Repository: denysvitali/happy_flutter
Catalog: l10n/app_*.arb
Languages: de, es, fr

# chatFailedToSend
source: Failed to send message
de: Nachricht senden fehlgeschlagen
es: Error al enviar mensaje
fr: Échec de l'envoi du message

# chatThinking
source: Claude is thinking...
de: Claude denkt nach...
es: Claude está pensando...
fr: Claude réfléchit...

# chatToolRunning
source: Running: {toolName}
de: Wird ausgeführt: {toolName}
es: Ejecutando: {toolName}
fr: Exécution : {toolName}

# settingsTitle
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres

# settingsConnectedAccounts
source: Connected Accounts
de: Verbundene Konten
es: Cuentas conectadas
fr: Comptes connectés

# settingsConnectAccount
source: Connect account
de: Konto verbinden
es: Conectar cuenta
fr: Connecter un compte

# settingsMachines
source: Machines
de: Maschinen
es: Máquinas

# settingsFeatures
source: Features
de: Funktionen
es: Características
fr: Fonctionnalités

# settingsAccount
source: Account
de: Konto
es: Cuenta
fr: Compte

# settingsAccountSubtitle
source: Manage your account details
de: Kontodetails verwalten
es: Administrar los detalles de tu cuenta
fr: Gérer les détails de votre compte

# settingsAppearance
source: Appearance
de: Erscheinungsbild
es: Apariencia
fr: Apparence

# settingsAppearanceSubtitle
source: Customize how the app looks
de: Anpassen, wie die App aussieht
es: Personalizar cómo se ve la aplicación
fr: Personnaliser l'apparence de l'application

# settingsVoiceAssistant
source: Voice Assistant
de: Sprachassistent
es: Asistente de voz
fr: Assistant vocal

# settingsVoiceAssistantSubtitle
source: Configure voice interaction preferences
de: Sprachinteraktionseinstellungen konfigurieren
es: Configurar preferencias de interacción de voz
fr: Configurer les préférences d'interaction vocale

# settingsFeaturesTitle
source: Features
de: Funktionen
es: Características
fr: Fonctionnalités

# settingsFeaturesSubtitle
source: Enable or disable app features
de: App-Funktionen aktivieren oder deaktivieren
es: Habilitar o deshabilitar características de la aplicación
fr: Activer ou désactiver les fonctionnalités de l'application

# settingsDeveloper
source: Developer
de: Entwickler
es: Desarrollador
fr: Développeur

# settingsDeveloperTools
source: Developer Tools
de: Entwicklertools
es: Herramientas de desarrollador
fr: Outils de développeur

# settingsAbout
source: About
de: Über
es: Acerca de
fr: À propos

# settingsAboutFooter
source: Happy Coder is a Codex and Claude Code mobile client. It's fully end-to-end encrypted and your account is stored only on your device. Not affiliated with Anthropic.
de: Happy Coder ist ein mobiler Client für Codex und Claude Code. Er ist vollständig Ende-zu-Ende-verschlüsselt und Ihr Konto wird nur auf Ihrem Gerät gespeichert. Nicht verbunden mit Anthropic.
es: Happy Coder es un cliente móvil de Codex y Claude Code. Está completamente cifrado de extremo a extremo y tu cuenta se almacena solo en tu dispositivo. No está afiliado con Anthropic.
fr: Happy Coder est un client mobile pour Codex et Claude Code. Il est entièrement crypté de bout en bout et votre compte est stocké uniquement sur votre appareil. Non affilié à Anthropic.

# settingsWhatsNew
source: What's New
de: Neuigkeiten
es: Novedades
fr: Nouveautés

# settingsWhatsNewSubtitle
source: See the latest updates and improvements
de: Die neuesten Updates und Verbesserungen ansehen
es: Ver las últimas actualizaciones y mejoras
fr: Voir les dernières mises à jour et améliorations

# settingsReportIssue
source: Report an Issue
de: Problem melden
es: Reportar un problema
fr: Signaler un problème

# settingsPrivacyPolicy
source: Privacy Policy
de: Datenschutzrichtlinie
es: Política de privacidad
fr: Politique de confidentialité

# settingsTermsOfService
source: Terms of Service
de: Nutzungsbedingungen
es: Términos de servicio
fr: Conditions d'utilisation

# settingsSupportUs
source: Support us
de: Unterstützen Sie uns
es: Apóyanos
fr: Soutenez-nous

# settingsSupportUsSubtitlePro
source: Thank you for your support!
de: Vielen Dank für Ihre Unterstützung!
es: ¡Gracias por tu apoyo!
fr: Merci pour votre soutien !

# settingsSupportUsSubtitle
source: Support project development
de: Projektentwicklung unterstützen
es: Apoyar el desarrollo del proyecto
fr: Soutenir le développement du projet

# settingsScanQrCodeToAuthenticate
source: Scan QR code to authenticate
de: QR-Code scannen zur Authentifizierung
es: Escanea el código QR para autenticarte
fr: Scannez le code QR pour vous authentifier

# settingsGithubConnected
source: Connected as @{login}
de: Verbunden als @{login}
es: Conectado como @{login}
fr: Connecté en tant que @{login}

# settingsConnectGithubAccount
source: Connect your GitHub account
de: Verbinden Sie Ihr GitHub-Konto
es: Conecta tu cuenta de GitHub
fr: Connectez votre compte GitHub

# settingsUsage
source: Usage
de: Nutzung
es: Uso
fr: Utilisation

# settingsUsageSubtitle
source: View your API usage and costs
de: API-Nutzung und -Kosten anzeigen
es: Ver tu uso y costos de API
fr: Voir votre utilisation et vos coûts d'API

# settingsProfiles
source: Profiles
de: Profile
es: Perfiles
fr: Profils

# settingsProfilesSubtitle
source: Manage environment variable profiles for sessions
de: Umgebungsvariablenprofile für Sitzungen verwalten
es: Administrar perfiles de variables de entorno para sesiones
fr: Gérer les profils de variables d'environnement pour les sessions

# settingsSignOut
source: Sign out
de: Abmelden
es: Cerrar sesión
fr: Déconnexion

# settingsSignOutConfirm
source: Are you sure you want to sign out? Make sure you have backed up your secret key!
de: Sind Sie sicher, dass Sie sich abmelden möchten? Stellen Sie sicher, dass Sie Ihren geheimen Schlüssel gesichert haben!
es: ¿Estás seguro de que deseas cerrar sesión? ¡Asegúrate de haber hecho una copia de seguridad de tu clave secreta!
fr: Êtes-vous sûr de vouloir vous déconnecter ? Assurez-vous d'avoir sauvegardé votre clé secrète !

# settingsLanguage
source: Language
de: Sprache
es: Idioma
fr: Langue

# settingsLanguageSubtitle
source: Choose your preferred language for the app interface
de: Wählen Sie Ihre bevorzugte Sprache für die App-Benutzeroberfläche
es: Elige tu idioma preferido para la interfaz de la aplicación
fr: Choisissez votre langue préférée pour l'interface de l'application

# settingsLanguageCurrent
source: Current Language
de: Aktuelle Sprache
es: Idioma actual
fr: Langue actuelle

# settingsLanguageAutomatic
source: Automatic
de: Automatisch
es: Automático
fr: Automatique

# settingsLanguageAutomaticSubtitle
source: Detect from device settings
de: Von Geräteeinstellungen erkennen
es: Detectar de la configuración del dispositivo
fr: Détecter les paramètres de l'appareil

# settingsLanguageNeedsRestart
source: Language Changed
de: Sprache geändert
es: Idioma cambiado
fr: Langue modifiée

# settingsLanguageNeedsRestartMessage
source: The app needs to restart to apply the new language setting.
de: Die App muss neu gestartet werden, um die neue Spracheinstellung anzuwenden.
es: La aplicación necesita reiniciarse para aplicar el nuevo idioma.
fr: L'application doit redémarrer pour appliquer le nouveau paramètre de langue.

# settingsLanguageRestartNow
source: Restart Now
de: Jetzt neu starten
es: Reiniciar ahora
fr: Redémarrer maintenant

# settingsLanguageSearchPlaceholder
source: Search languages...
de: Sprachen suchen...
es: Buscar idiomas...
fr: Rechercher des langues...

# settingsAppearanceTheme
source: Theme
de: Design
es: Tema
fr: Thème

# settingsAppearanceThemeSubtitle
source: Choose your preferred color scheme
de: Wählen Sie Ihr bevorzugtes Farbschema
es: Elige tu esquema de colores preferido
fr: Choisissez votre schéma de couleurs préféré

# settingsAppearanceThemeAdaptive
source: Adaptive
de: Adaptiv
es: Adaptativo
fr: Adaptatif

# settingsAppearanceThemeAdaptiveSubtitle
source: Match system settings
de: Systemeinstellungen entsprechen
es: Coincidir con la configuración del sistema
fr: Correspondre aux paramètres système

# settingsAppearanceThemeLight
source: Light
de: Hell
es: Claro
fr: Clair

# settingsAppearanceThemeLightSubtitle
source: Always use light theme
de: Immer helles Design verwenden
es: Siempre usar tema claro
fr: Toujours utiliser le thème clair

# settingsAppearanceThemeDark
source: Dark
de: Dunkel
es: Oscuro
fr: Sombre

# settingsAppearanceThemeDarkSubtitle
source: Always use dark theme
de: Immer dunkles Design verwenden
es: Siempre usar tema oscuro
fr: Toujours utiliser le thème sombre

# settingsAppearanceDisplay
source: Display
de: Anzeige
es: Pantalla
fr: Affichage

# settingsAppearanceDisplaySubtitle
source: Control layout and spacing
de: Layout und Abstand steuern
es: Controlar diseño y espaciado
fr: Contrôler la mise en page et l'espacement

# settingsAppearanceInlineToolCalls
source: Inline Tool Calls
de: Inline-Tool-Aufrufe
es: Llamadas de herramientas en línea
fr: Appels d'outils en ligne

# settingsAppearanceInlineToolCallsSubtitle
source: Display tool calls directly in chat messages
de: Tool-Aufrufe direkt in Chat-Nachrichten anzeigen
es: Mostrar llamadas de herramientas directamente en mensajes de chat
fr: Afficher les appels d'outils directement dans les messages de chat

# settingsAppearanceExpandTodoLists
source: Expand Todo Lists
de: Todo-Listen erweitern
es: Expandir listas de tareas
fr: Développer les listes de tâches

# settingsAppearanceExpandTodoListsSubtitle
source: Show all todos instead of just changes
de: Alle Todos anzeigen anstatt nur Änderungen
es: Mostrar todas las tareas en lugar de solo cambios
fr: Afficher toutes les tâches au lieu des seuls changements

# settingsAppearanceShowLineNumbersInDiffs
source: Show Line Numbers in Diffs
de: Zeilennummern in Diffs anzeigen
es: Mostrar números de línea en diffs
fr: Afficher les numéros de ligne dans les diffs

# settingsAppearanceShowLineNumbersInDiffsSubtitle
source: Display line numbers in code diffs
de: Zeilennummern in Code-Diffs anzeigen
es: Mostrar números de línea en diffs de código
fr: Afficher les numéros de ligne dans les diffs de code

# settingsAppearanceShowLineNumbersInToolViews
source: Show Line Numbers in Tool Views
de: Zeilennummern in Tool-Ansichten anzeigen
es: Mostrar números de línea en vistas de herramientas
fr: Afficher les numéros de ligne dans les vues d'outils

# settingsAppearanceShowLineNumbersInToolViewsSubtitle
source: Display line numbers in tool view diffs
de: Zeilennummern in Tool-View-Diffs anzeigen
es: Mostrar números de línea en diffs de vistas de herramientas
fr: Afficher les numéros de ligne dans les diffs des vues d'outils

# settingsAppearanceWrapLinesInDiffs
source: Wrap Lines in Diffs
de: Zeilen in Diffs umbrechen
es: Ajustar líneas en diffs
fr: Ajuster les lignes dans les diffs

# settingsAppearanceWrapLinesInDiffsSubtitle
source: Wrap long lines instead of horizontal scrolling in diff views
de: Lange Zeilen umbrechen anstatt horizontal zu scrollen
es: Ajustar líneas largas en lugar de desplazamiento horizontal en vistas de diff
fr: Ajuster les longues lignes au lieu du défilement horizontal

# settingsAppearanceAlwaysShowContextSize
source: Always Show Context Size
de: Kontextgröße immer anzeigen
es: Siempre mostrar tamaño de contexto
fr: Toujours afficher la taille du contexte

# settingsAppearanceAlwaysShowContextSizeSubtitle
source: Display context usage even when not near limit
de: Kontextnutzung anzeigen, auch wenn nicht in der Nähe des Limits
es: Mostrar uso de contexto incluso cuando no está cerca del límite
fr: Afficher l'utilisation du contexte même lorsqu'il n'est pas près de la limite

# settingsAppearanceAvatarStyle
source: Avatar Style
de: Avatar-Stil
es: Estilo de avatar
fr: Style d'avatar

# settingsAppearanceAvatarStyleSubtitle
source: Choose session avatar appearance
de: Sitzungsavatar-Erscheinung wählen
es: Elegir apariencia del avatar de sesión
fr: Choisir l'apparence de l'avatar de session

# settingsAppearanceAvatarStylePixelated
source: Pixelated
de: Pixeliert
es: Pixelado
fr: Pixelisé

# settingsAppearanceAvatarStyleGradient
source: Gradient
de: Verlauf
es: Gradiente
fr: Dégradé

# settingsAppearanceAvatarStyleBrutalist
source: Brutalist
de: Brutalistisch
es: Brutalista
fr: Brutaliste

# settingsAppearanceShowFlavorIcons
source: Show AI Provider Icons
de: KI-Anbieter-Symbole anzeigen
es: Mostrar iconos de proveedores de IA
fr: Afficher les icônes des fournisseurs IA

# settingsAppearanceShowFlavorIconsSubtitle
source: Display AI provider icons on session avatars
de: KI-Anbieter-Symbole auf Sitzungsavatars anzeigen
es: Mostrar iconos de proveedores de IA en avatares de sesión
fr: Afficher les icônes des fournisseurs IA sur les avatars de session

# settingsAppearanceCompactSessionView
source: Compact Session View
de: Kompakte Sitzungsansicht
es: Vista compacta de sesión
fr: Vue compacte des sessions

# settingsAppearanceCompactSessionViewSubtitle
source: Show active sessions in a more compact layout
de: Aktive Sitzungen in einem kompakteren Layout anzeigen
es: Mostrar sesiones activas en un diseño más compacto
fr: Afficher les sessions actives dans une mise en page plus compacte

# settingsFeaturesExperiments
source: Experiments
de: Experimente
es: Experimentos
fr: Expériences

# settingsFeaturesExperimentsSubtitle
source: Enable experimental features that are still in development. These features may be unstable or change without notice.
de: Experimentelle Funktionen aktivieren, die sich noch in der Entwicklung befinden. Diese Funktionen können instabil sein oder sich ohne Vorankündigung ändern.
es: Habilitar características experimentales que aún están en desarrollo. Estas características pueden ser inestables o cambiar sin previo aviso.
fr: Activer les fonctionnalités expérimentales encore en développement. Ces fonctionnalités peuvent être instables ou changer sans préavis.

# settingsFeaturesExperimentalFeatures
source: Experimental Features
de: Experimentelle Funktionen
es: Características experimentales
fr: Fonctionnalités expérimentales

# settingsFeaturesExperimentalFeaturesEnabled
source: Experimental features enabled
de: Experimentelle Funktionen aktiviert
es: Características experimentales habilitadas
fr: Fonctionnalités expérimentales activées

# settingsFeaturesExperimentalFeaturesDisabled
source: Using stable features only
de: Nur stabile Funktionen verwenden
es: Usando características estables únicamente
fr: Utilisation des fonctionnalités stables uniquement

# settingsFeaturesWebFeatures
source: Web Features
de: Web-Funktionen
es: Características web
fr: Fonctionnalités Web

# settingsFeaturesWebFeaturesSubtitle
source: Features available only in the web version of the app.
de: Funktionen, die nur in der Web-Version der App verfügbar sind.
es: Características disponibles solo en la versión web de la aplicación.
fr: Fonctionnalités disponibles uniquement dans la version Web de l'application.

# settingsFeaturesEnterToSend
source: Enter to Send
de: Enter zum Senden
es: Enter para enviar
fr: Entrée pour envoyer

# settingsFeaturesEnterToSendEnabled
source: Press Enter to send (Shift+Enter for a new line)
de: Enter drücken zum Senden (Shift+Enter für neue Zeile)
es: Presiona Enter para enviar (Shift+Enter para nueva línea)
fr: Appuyez sur Entrée pour envoyer (Maj+Entrée pour nouvelle ligne)

# settingsFeaturesEnterToSendDisabled
source: Enter inserts a new line
de: Enter fügt eine neue Zeile ein
es: Enter inserta una nueva línea
fr: Entrée insère une nouvelle ligne

# settingsFeaturesCommandPalette
source: Command Palette
de: Befehlspalette
es: Paleta de comandos
fr: Palette de commandes

# settingsFeaturesCommandPaletteEnabled
source: Press ⌘K to open
de: Drücken Sie ⌘K zum Öffnen
es: Presiona ⌘K para abrir
fr: Appuyez sur ⌘K pour ouvrir

# settingsFeaturesCommandPaletteDisabled
source: Quick command access disabled
de: Schneller Befehlszugriff deaktiviert
es: Acceso rápido a comandos deshabilitado
fr: Accès rapide aux commandes désactivé

# settingsFeaturesMarkdownCopyV2
source: Markdown Copy v2
de: Markdown kopieren v2
es: Copiar Markdown v2
fr: Copier Markdown v2

# settingsFeaturesMarkdownCopyV2Subtitle
source: Long press opens copy modal
de: Langes Drücken öffnet das Kopiermodal
es: Mantener presionado abre modal de copia
fr: Appui long ouvre le modal de copie

# settingsFeaturesHideInactiveSessions
source: Hide inactive sessions
de: Inaktive Sitzungen ausblenden
es: Ocultar sesiones inactivas
fr: Masquer les sessions inactives

# settingsFeaturesHideInactiveSessionsSubtitle
source: Show only active chats in your list
de: Nur aktive Chats in Ihrer Liste anzeigen
es: Mostrar solo chats activos en tu lista
fr: Afficher uniquement les chats actifs dans votre liste

# settingsFeaturesEnhancedSessionWizard
source: Enhanced Session Wizard
de: Verbesserter Sitzungsassistent
es: Asistente de sesión mejorado
fr: Assistant de session amélioré

# settingsFeaturesEnhancedSessionWizardEnabled
source: Profile-first session launcher active
de: Profilbasierter Sitzungsstarter aktiv
es: Lanzador de sesión basado en perfil activo
fr: Lanceur de session basé sur le profil actif

# settingsFeaturesEnhancedSessionWizardDisabled
source: Using standard session launcher
de: Standard-Sitzungsstarter verwenden
es: Usando lanzador de sesión estándar
fr: Utilisation du lanceur de session standard

# settingsAccountTitle
source: Account Settings
de: Kontoeinstellungen
es: Configuración de cuenta
fr: Paramètres du compte

# settingsAccountStatus
source: Status
es: Estado
fr: État

# settingsAccountStatusActive
source: Active
de: Aktiv
es: Activo
fr: Actif

# settingsAccountStatusNotAuthenticated
source: Not Authenticated
de: Nicht authentifiziert
es: No autenticado
fr: Non authentifié

# settingsAccountAnonymousId
source: Anonymous ID
de: Anonyme ID
es: ID anónimo
fr: ID anonyme

# settingsAccountPublicId
source: Public ID
de: Öffentliche ID
es: ID público
fr: ID public

# settingsAccountNotAvailable
source: Not available
de: Nicht verfügbar
es: No disponible
fr: Non disponible

# settingsAccountLinkNewDevice
source: Link New Device
de: Neues Gerät verknüpfen
es: Vincular nuevo dispositivo
fr: Lier un nouvel appareil

# settingsAccountLinkNewDeviceSubtitle
source: Scan QR code to link device
de: QR-Code scannen, um Gerät zu verknüpfen
es: Escanea el código QR para vincular dispositivo
fr: Scannez le code QR pour lier l'appareil

# settingsAccountProfile
source: Profile
de: Profil
es: Perfil
fr: Profil

# settingsAccountName
source: Name
es: Nombre
fr: Nom

# settingsAccountTapToDisconnect
source: Tap to disconnect
de: Tippen zum Trennen
es: Toca para desconectar
fr: Appuyez pour déconnecter

# settingsAccountServer
source: Server
es: Servidor
fr: Serveur

# settingsAccountBackup
source: Backup
de: Sicherung
es: Respaldo
fr: Sauvegarde

# settingsAccountBackupDescription
source: Your secret key is the only way to recover your account. Save it in a secure place like a password manager.
de: Ihr geheimer Schlüssel ist der einzige Weg, um Ihr Konto wiederherzustellen. Bewahren Sie ihn an einem sicheren Ort wie einem Passwort-Manager auf.
es: Tu clave secreta es la única forma de recuperar tu cuenta. Guárdala en un lugar seguro como un administrador de contraseñas.
fr: Votre clé secrète est le seul moyen de récupérer votre compte. Conservez-la dans un endroit sûr comme un gestionnaire de mots de passe.

# settingsAccountSecretKey
source: Secret Key
de: Geheimer Schlüssel
es: Clave secreta
fr: Clé secrète

# settingsAccountTapToReveal
source: Tap to reveal
de: Tippen zum Anzeigen
es: Toca para revelar
fr: Appuyez pour révéler

# settingsAccountTapToHide
source: Tap to hide
de: Tippen zum Ausblenden
es: Toca para ocultar
fr: Appuyez pour masquer

# settingsAccountSecretKeyLabel
source: SECRET KEY (TAP TO COPY)
de: GEHEIMER SCHLÜSSEL (TIPPEN ZUM KOPIEREN)
es: CLAVE SECRETA (TOCA PARA COPIAR)
fr: CLÉ SECRÈTE (APPUYEZ POUR COPIER)

# settingsAccountSecretKeyCopied
source: Secret key copied to clipboard. Store it in a safe place!
de: Geheimer Schlüssel in Zwischenablage kopiert. Bewahren Sie ihn an einem sicheren Ort auf!
es: Clave secreta copiada al portapapeles. ¡Guárdala en un lugar seguro!
fr: Clé secrète copiée dans le presse-papiers. Conservez-la dans un lieu sûr !

# settingsAccountSecretKeyCopyFailed
source: Failed to copy secret key
de: Kopieren des geheimen Schlüssels fehlgeschlagen
es: Error al copiar la clave secreta
fr: Échec de la copie de la clé secrète

# settingsAccountPrivacy
source: Privacy
de: Datenschutz
es: Privacidad
fr: Confidentialité

# settingsAccountPrivacyDescription
source: Help improve the app by sharing anonymous usage data. No personal information is collected.
de: Helfen Sie, die App zu verbessern, indem Sie anonyme Nutzungsdaten teilen. Es werden keine persönlichen Informationen gesammelt.
es: Ayuda a mejorar la aplicación compartiendo datos de uso anónimos. No se recopila información personal.
fr: Aidez à améliorer l'application en partageant des données d'utilisation anonymes. Aucune information personnelle n'est collectée.

# settingsAccountAnalytics
source: Analytics
de: Analytik
es: Analítica
fr: Analytique

# settingsAccountAnalyticsDisabled
source: No data is shared
de: Es werden keine Daten geteilt
es: No se comparten datos
fr: Aucune donnée n'est partagée

# settingsAccountAnalyticsEnabled
source: Anonymous usage data is shared
de: Anonyme Nutzungsdaten werden geteilt
es: Se comparten datos de uso anónimos
fr: Des données d'utilisation anonymes sont partagées

# settingsAccountDangerZone
source: Danger Zone
de: Gefahrenzone
es: Zona de peligro
fr: Zone de danger

# settingsAccountLogout
source: Logout
de: Abmelden
es: Cerrar sesión
fr: Déconnexion

# settingsAccountLogoutSubtitle
source: Sign out and clear local data
de: Abmelden und lokale Daten löschen
es: Salir y borrar datos locales
fr: Se déconnecter et effacer les données locales

# settingsServerTitle
source: Server Configuration
de: Serverkonfiguration
es: Configuración del servidor
fr: Configuration du serveur

# settingsServerUrl
source: Server URL
es: URL del servidor
fr: URL du serveur

# settingsServerUrlLabel
source: Please enter a server URL
de: Bitte geben Sie die Server-URL ein
es: Por favor ingresa la URL del servidor
fr: Veuillez entrer l'URL du serveur

# settingsServerNotValidHappyServer
source: Not a valid Happy Server
de: Kein gültiger Happy-Server
es: No es un servidor de Happy válido
fr: N'est pas un serveur Happy valide

# settingsServerChangeServer
source: Change Server
de: Server ändern
es: Cambiar servidor
fr: Changer de serveur

# settingsServerContinueWithServer
source: Continue with this server?
de: Mit diesem Server fortfahren?
es: ¿Continuar con este servidor?
fr: Continuer avec ce serveur ?

# settingsServerResetToDefault
source: Reset to Default
de: Auf Standard zurücksetzen
es: Restablecer a predeterminado
fr: Réinitialiser par défaut

# settingsServerResetServerDefault
source: Reset server to default?
de: Server auf Standard zurücksetzen?
es: ¿Restablecer servidor a predeterminado?
fr: Réinitialiser le serveur par défaut ?

# settingsServerValidating
source: Validating...
de: Wird validiert...
es: Validando...
fr: Validation...

# settingsServerValidatingServer
source: Validating server...
de: Server wird validiert...
es: Validando servidor...
fr: Validation du serveur...

# settingsServerServerReturnedError
source: Server returned an error
de: Server hat einen Fehler zurückgegeben
es: El servidor devolvió un error
fr: Le serveur a renvoyé une erreur

# settingsServerFailedToConnectToServer
source: Failed to connect to server
de: Verbindung zum Server fehlgeschlagen
es: Error al conectar al servidor
fr: Échec de la connexion au serveur

# settingsServerCurrentlyUsingCustomServer
source: Currently using custom server
de: Derzeit wird ein benutzerdefinierter Server verwendet
es: Usando servidor personalizado actualmente
fr: Utilisation d'un serveur personnalisé
