Repository: denysvitali/happy_flutter
Catalog: l10n/app_*.arb
Languages: de, es, fr

# appSubtitle
source: Mobile client for Claude Code & Codex
de: Mobilclient für Claude Code & Codex
es: Cliente móvil para Claude Code & Codex
fr: Client mobile pour Claude Code & Codex

# appVersion
source: Version
es: Versión

# appLoading
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...

# appRetry
source: Retry
de: Wiederholen
es: Reintentar
fr: Réessayer

# commonCancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler

# commonOk
source: OK
es: Aceptar

# commonYes
source: Yes
de: Ja
es: Sí
fr: Oui

# commonContinue
source: Continue
de: Fortfahren
es: Continuar
fr: Continuer

# commonBack
source: Back
de: Zurück
es: Atrás
fr: Retour

# commonSave
source: Save
de: Speichern
es: Guardar
fr: Enregistrer

# commonSaveAs
source: Save As
de: Speichern unter
es: Guardar como
fr: Enregistrer sous

# commonDelete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer

# commonCreate
source: Create
de: Erstellen
es: Crear
fr: Créer

# commonRename
source: Rename
de: Umbenennen
es: Renombrar
fr: Renommer

# commonReset
source: Reset
de: Zurücksetzen
es: Restablecer
fr: Réinitialiser

# commonSuccess
source: Success
de: Erfolg
es: Éxito
fr: Succès

# commonCopy
source: Copy
de: Kopieren
es: Copiar
fr: Copier

# commonCopied
source: Copied
de: Kopiert
es: Copiado
fr: Copié

# commonLogout
source: Logout
de: Abmelden
es: Cerrar sesión
fr: Déconnexion

# commonDiscard
source: Discard
de: Verwerfen
es: Descartar
fr: Ignorer

# commonOptional
source: optional
es: opcional
fr: optionnel

# commonScanning
source: Scanning...
de: Scannen...
es: Escaneando...
fr: Scan en cours...

# commonUrlPlaceholder
source: https://example.com
de: https://beispiel.com
es: https://ejemplo.com
fr: https://exemple.com

# commonHome
source: Home
de: Startseite
es: Inicio
fr: Accueil

# commonMessage
source: Message
de: Nachricht
es: Mensaje

# commonFiles
source: Files
de: Dateien
es: Archivos
fr: Fichiers

# commonFileViewer
source: File Viewer
de: Dateibetrachter
es: Visor de archivos
fr: Visionneuse de fichiers

# commonLoading
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...

# commonDeleteConfirmTitle
source: Confirm Deletion
de: Löschen bestätigen
es: Confirmar eliminación
fr: Confirmer la suppression

# commonDeleteConfirmMessage
source: Are you sure you want to delete this?
de: Sind Sie sicher, dass Sie dies löschen möchten?
es: ¿Estás seguro de que quieres eliminar esto?
fr: Êtes-vous sûr de vouloir supprimer ceci ?

# tabsInbox
source: Inbox
de: Posteingang
es: Bandeja
fr: Boîte de réception

# tabsSessions
source: Terminals
es: Terminales
fr: Terminaux

# tabsSettings
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres

# inboxEmptyTitle
source: Empty Inbox
de: Posteingang leer
es: Bandeja vacía
fr: Boîte de réception vide

# inboxEmptyDescription
source: Connect with friends to start sharing sessions
de: Verbinden Sie sich mit Freunden, um das Freigeben von Sitzungen zu starten
es: Conecta con amigos para comenzar a compartir sesiones
fr: Connectez-vous avec des amis pour commencer à partager des sessions

# inboxUpdates
source: Updates
es: Actualizaciones
fr: Mises à jour

# statusConnected
source: Connected
de: Verbunden
es: Conectado
fr: Connecté

# statusConnecting
source: Connecting
de: Verbinden
es: Conectando
fr: Connexion

# statusDisconnected
source: Disconnected
de: Getrennt
es: Desconectado
fr: Déconnecté

# statusOnline
source: Online
es: En línea
fr: En ligne

# statusOffline
source: Offline
es: Fuera de línea
fr: Hors ligne

# statusActiveNow
source: Active now
de: Jetzt aktiv
es: Activo ahora
fr: Actif maintenant

# statusUnknown
source: Unknown
de: Unbekannt
es: Desconocido
fr: Inconnu

# statusPermissionRequired
source: Permission required
de: Berechtigung erforderlich
es: Permiso requerido
fr: Permission requise

# statusLastSeen
source: Last seen {time}
de: Zuletzt gesehen {time}
es: Última vez {time}
fr: Dernière connexion {time}

# timeJustNow
source: just now
de: gerade eben
es: justo ahora
fr: à l'instant

# timeMinutesAgo
source: {count, plural, =1 {1 minute ago} other {{count} minutes ago}}
de: vor {count, plural, =1 {1 Minute} other {{count} Minuten}}
es: {count, plural, =1 {hace 1 minuto} other {hace {count} minutos}}
fr: il y a {count, plural, =1 {1 minute} other {{count} minutes}}

# timeHoursAgo
source: {count, plural, =1 {1 hour ago} other {{count} hours ago}}
de: vor {count, plural, =1 {1 Stunde} other {{count} Stunden}}
es: {count, plural, =1 {hace 1 hora} other {hace {count} horas}}
fr: il y a {count, plural, =1 {1 heure} other {{count} heures}}

# authTitle
source: Authenticate
de: Authentifizieren
es: Autenticar
fr: S'authentifier

# authAccessDenied
source: Access denied
de: Zugriff verweigert
es: Acceso denegado
fr: Accès refusé

# authAuthenticationFailed
source: Authentication failed
de: Authentifizierung fehlgeschlagen
es: Autenticación fallida
fr: Échec de l'authentification

# authEnterSecretKey
source: Please enter a secret key
de: Bitte geben Sie einen geheimen Schlüssel ein
es: Por favor ingresa una clave secreta
fr: Veuillez entrer une clé secrète

# authInvalidSecretKey
source: Invalid secret key. Please check and try again.
de: Ungültiger geheimer Schlüssel. Bitte überprüfen und erneut versuchen.
es: Clave secreta inválida. Por favor verifica e intenta de nuevo.
fr: Clé secrète invalide. Veuillez vérifier et réessayer.

# authRestoreAccount
source: Restore Account
de: Konto wiederherstellen
es: Restaurar cuenta
fr: Restaurer le compte

# authEnterUrlManually
source: Enter URL manually
de: URL manuell eingeben
es: Ingresar URL manualmente
fr: Entrer l'URL manuellement

# authPasteAuthUrl
source: Paste the authentication URL from your terminal
de: Fügen Sie die Authentifizierungs-URL von Ihrem Terminal ein
es: Pega la URL de autenticación de tu terminal
fr: Collez l'URL d'authentification de votre terminal

# authAuthenticateTerminal
source: Authenticate Terminal
de: Terminal authentifizieren
es: Autenticar terminal
fr: Authentifier le terminal

# authAuthenticateWithUrlPaste
source: Authenticate Terminal with URL paste
de: Terminal mit URL-Einfügen authentifizieren
es: Autenticar terminal con pegar URL
fr: Authentifier le terminal avec collage d'URL

# authCameraPermissionsRequired
source: Camera permissions are required to scan QR codes
de: Kameraberechtigungen erforderlich, um QR-Codes zu scannen
es: Se requieren permisos de cámara para escanear códigos QR
fr: Les permissions de caméra sont requises pour scanner les codes QR

# authExchangingTokens
source: Exchanging tokens...
de: Token werden ausgetauscht...
es: Intercambiando tokens...
fr: Échange de jetons...

# authClaudeAuthSuccess
source: Successfully connected to Claude
de: Erfolgreich mit Claude verbunden
es: Conectado exitosamente a Claude
fr: Connexion réussie à Claude

# welcomeTitle
source: Codex and Claude Code mobile client
de: Mobiler Codex und Claude Code Client
es: Cliente móvil de Codex y Claude Code
fr: Client mobile Codex et Claude Code

# welcomeSubtitle
source: End-to-end encrypted and your account is stored only on your device.
de: Ende-zu-Ende-verschlüsselt und Ihr Konto wird nur auf Ihrem Gerät gespeichert.
es: Cifrado de extremo a extremo y tu cuenta se almacena solo en tu dispositivo.
fr: Cryptage de bout en bout et votre compte est stocké uniquement sur votre appareil.

# welcomeCreateAccount
source: Create account
de: Konto erstellen
es: Crear cuenta
fr: Créer un compte

# welcomeLinkOrRestoreAccount
source: Link or restore account
de: Konto verknüpfen oder wiederherstellen
es: Vincular o restaurar cuenta
fr: Lier ou restaurer un compte

# welcomeLoginWithMobileApp
source: Login with mobile app
de: Mit mobiler App anmelden
es: Iniciar sesión con la aplicación móvil
fr: Connexion avec l'application mobile

# sessionTitle
source: Sessions
de: Sitzungen
es: Sesiones

# sessionNewSession
source: New Session
de: Neue Sitzung
es: Nueva sesión
fr: Nouvelle session

# sessionStartNewToGetStarted
source: Start a new session to get started
de: Starten Sie eine neue Sitzung, um zu beginnen
es: Inicia una nueva sesión para comenzar
fr: Démarrez une nouvelle session pour commencer

# sessionNoSessionsYet
source: No sessions yet
de: Noch keine Sitzungen
es: Aún no hay sesiones
fr: Pas encore de sessions

# sessionActiveSessions
source: Active
de: Aktiv
es: Activo
fr: Actif

# sessionHistory
source: History
de: Verlauf
es: Historial
fr: Historique

# sessionMachine
source: Machine
de: Maschine
es: Máquina

# sessionSelectMachine
source: Select a machine
de: Maschine auswählen
es: Seleccionar una máquina
fr: Sélectionner une machine

# sessionPath
source: Path
de: Pfad
es: Ruta
fr: Chemin

# sessionPathHint
source: Enter path
de: Pfad eingeben
es: Ingresa la ruta
fr: Entrer le chemin

# sessionInputPlaceholder
source: Type a message ...
de: Nachricht eingeben ...
es: Escribe un mensaje ...
fr: Tapez un message ...

# sessionStartSession
source: Start Session
de: Sitzung starten
es: Iniciar sesión
fr: Démarrer la session

# sessionStarting
source: Starting session...
de: Sitzung wird gestartet...
es: Iniciando sesión...
fr: Démarrage de la session...

source: Session Started
de: Sitzung gestartet
es: Sesión iniciada
fr: Session démarrée

# sessionStartedMessage
source: The session has been started successfully.
de: Die Sitzung wurde erfolgreich gestartet.
es: La sesión ha sido iniciada exitosamente.
fr: La session a été démarrée avec succès.

# sessionFailedToStart
source: Failed to start session. Make sure the daemon is running on the target machine.
de: Sitzungsstart fehlgeschlagen. Stellen Sie sicher, dass der Daemon auf der Zielmaschine ausgeführt wird.
es: Error al iniciar la sesión. Asegúrate de que el daemon esté ejecutándose en la máquina objetivo.
fr: Échec du démarrage de la session. Assurez-vous que le démon fonctionne sur la machine cible.

# sessionTimeout
source: Session startup timed out. The machine may be slow or the daemon may not be responding.
de: Sitzungsstart timed out. Die Maschine ist möglicherweise langsam oder der Daemon reagiert nicht.
es: El inicio de la sesión expiró. La máquina puede estar lenta o el daemon no está respondiendo.
fr: Le démarrage de la session a expiré. La machine peut être lente ou le démon ne répond pas.

# sessionNotConnectedToServer
source: Not connected to server. Check your internet connection.
de: Nicht mit dem Server verbunden. Überprüfen Sie Ihre Internetverbindung.
es: No conectado al servidor. Verifica tu conexión a internet.
fr: Non connecté au serveur. Vérifiez votre connexion Internet.

# sessionNoMachineSelected
source: Please select a machine to start the session
de: Bitte wählen Sie eine Maschine aus, um die Sitzung zu starten
es: Por favor selecciona una máquina para iniciar la sesión
fr: Veuillez sélectionner une machine pour démarrer la session

# sessionNoPathSelected
source: Please select a directory to start the session in
de: Bitte wählen Sie ein Verzeichnis aus, um die Sitzung zu starten
es: Por favor selecciona un directorio para iniciar la sesión
fr: Veuillez sélectionner un répertoire pour démarrer la session

# sessionTypeTitle
source: Session Type
de: Sitzungstyp
es: Tipo de sesión
fr: Type de session

# sessionTypeComingSoon
source: Coming soon
de: Demnächst
es: Próximamente
fr: Bientôt disponible

# newSessionTitle
source: Start New Session
de: Neue Sitzung starten
es: Iniciar nueva sesión
fr: Démarrer une nouvelle session

# newSessionNoMachinesFound
source: No machines found. Start a Happy session on your computer first.
de: Keine Maschinen gefunden. Starten Sie zuerst eine Happy-Sitzung auf Ihrem Computer.
es: No se encontraron máquinas. Primero inicia una sesión de Happy en tu computadora.
fr: Aucune machine trouvée. Démarrez d'abord une session Happy sur votre ordinateur.

# newSessionAllMachinesOffline
source: All machines appear offline
de: Alle Maschinen scheinen offline zu sein
es: Todas las máquinas parecen estar fuera de línea
fr: Toutes les machines semblent être hors ligne

# newSessionMachineDetails
source: View machine details →
de: Maschinendetails anzeigen →
es: Ver detalles de la máquina →
fr: Voir les détails de la machine →

# newSessionDirectoryDoesNotExist
source: Directory Not Found
de: Verzeichnis nicht gefunden
es: Directorio no encontrado
fr: Répertoire non trouvé

# newSessionCreateDirectoryConfirm
source: The directory {directory} does not exist. Do you want to create it?
de: Das Verzeichnis {directory} existiert nicht. Möchten Sie es erstellen?
es: El directorio {directory} no existe. ¿Deseas crearlo?
fr: Le répertoire {directory} n'existe pas. Voulez-vous le créer ?

# newSessionSessionSpawningFailed
source: Session spawning failed - no session ID returned.
de: Sitzungserstellung fehlgeschlagen - keine Sitzungs-ID zurückgegeben.
es: Error al crear la sesión - no se devolvió ningún ID de sesión.
fr: Échec de la création de la session - aucun ID de session retourné.

# sessionHistoryTitle
source: Session History
de: Sitzungsverlauf
es: Historial de sesiones
fr: Historique des sessions

# sessionHistoryEmpty
source: No sessions found
de: Keine Sitzungen gefunden
es: No se encontraron sesiones
fr: Aucune session trouvée

# sessionHistoryToday
source: Today
de: Heute
es: Hoy
fr: Aujourd'hui

# sessionHistoryYesterday
source: Yesterday
de: Gestern
es: Ayer
fr: Hier

# sessionHistoryDaysAgo
source: {count, plural, =1 {1 day ago} other {{count} days ago}}
de: vor {count, plural, =1 {1 Tag} other {{count} Tagen}}
es: {count, plural, =1 {hace 1 día} other {hace {count} días}}
fr: il y a {count, plural, =1 {1 jour} other {{count} jours}}

# sessionHistoryViewAll
source: View all sessions
de: Alle Sitzungen anzeigen
es: Ver todas las sesiones
fr: Voir toutes les sessions

# sessionInfoTitle
source: Session Info
de: Sitzungsinformationen
es: Información de sesión
fr: Informations sur la session

# sessionInfoHappySessionId
source: Happy Session ID
de: Happy-Sitzungs-ID
es: ID de sesión de Happy
fr: ID de session Happy

# sessionInfoClaudeCodeSessionId
source: Claude Code Session ID
de: Claude Code-Sitzungs-ID
es: ID de sesión de Claude Code
fr: ID de session Claude Code

# sessionInfoAiProvider
source: AI Provider
de: KI-Anbieter
es: Proveedor de IA
fr: Fournisseur IA

# sessionInfoConnectionStatus
source: Connection Status
de: Verbindungsstatus
es: Estado de conexión
fr: État de la connexion

# sessionInfoCreated
source: Created
de: Erstellt
es: Creado
fr: Créé

# sessionInfoLastUpdated
source: Last Updated
de: Zuletzt aktualisiert
es: Última actualización
fr: Dernière mise à jour

# sessionInfoSequence
source: Sequence
de: Sequenz
es: Secuencia
fr: Séquence

# sessionInfoMetadata
source: Metadata
de: Metadaten
es: Metadatos
fr: Métadonnées

# sessionInfoPath
source: Path
de: Pfad
es: Ruta
fr: Chemin

# sessionInfoOperatingSystem
source: Operating System
de: Betriebssystem
es: Sistema operativo
fr: Système d'exploitation

# sessionInfoProcessId
source: Process ID
de: Prozess-ID
es: ID de proceso
fr: ID de processus

# sessionInfoCliVersion
source: CLI Version
es: Versión de CLI
fr: Version CLI

# sessionInfoAgentState
source: Agent State
de: Agent-Status
es: Estado del agente
fr: État de l'agent

# sessionInfoControlledByUser
source: Controlled by User
de: Vom Benutzer gesteuert
es: Controlado por el usuario
fr: Contrôlé par l'utilisateur

# sessionInfoPendingRequests
source: Pending Requests
de: Ausstehende Anfragen
es: Solicitudes pendientes
fr: Requêtes en attente

# sessionInfoActivity
source: Activity
de: Aktivität
es: Actividad
fr: Activité

# sessionInfoThinking
source: Thinking
de: Denkt
es: Pensando
fr: Réflexion

# sessionInfoThinkingSince
source: Thinking Since
de: Denkt seit
es: Pensando desde
fr: Réflexion depuis

# sessionInfoCliVersionOutdated
source: CLI Update Required
de: CLI-Update erforderlich
es: Actualización de CLI requerida
fr: Mise à jour CLI requise

# sessionInfoCliVersionOutdatedMessage
source: Version {currentVersion} installed. Update to {requiredVersion} or later
de: Version {currentVersion} installiert. Aktualisieren Sie auf {requiredVersion} oder höher
es: Versión {currentVersion} instalada. Actualiza a {requiredVersion} o posterior
fr: Version {currentVersion} installée. Mettez à jour vers {requiredVersion} ou version ultérieure

# sessionInfoUpdateCliInstructions
source: Please run npm install -g happy-coder@latest
de: Bitte führen Sie npm install -g happy-coder@latest aus
es: Por favor ejecuta npm install -g happy-coder@latest
fr: Veuillez exécuter npm install -g happy-coder@latest

# sessionInfoQuickActions
source: Quick Actions
de: Schnellaktionen
es: Acciones rápidas
fr: Actions rapides

# sessionInfoViewMachine
source: View Machine
de: Maschine anzeigen
es: Ver máquina
fr: Voir la machine

# sessionInfoViewMachineSubtitle
source: View machine details and sessions
de: Maschinendetails und Sitzungen anzeigen
es: Ver detalles de la máquina y sesiones
fr: Voir les détails de la machine et les sessions

# sessionInfoKillSession
source: Kill Session
de: Sitzung beenden
es: Terminar sesión
fr: Terminer la session

# sessionInfoKillSessionConfirm
source: Are you sure you want to terminate this session?
de: Sind Sie sicher, dass Sie diese Sitzung beenden möchten?
es: ¿Estás seguro de que deseas terminar esta sesión?
fr: Êtes-vous sûr de vouloir terminer cette session ?

# sessionInfoKillSessionSubtitle
source: Immediately terminate the session
de: Sitzung sofort beenden
es: Terminar la sesión inmediatamente
fr: Terminer immédiatement la session

# sessionInfoArchiveSession
source: Archive Session
de: Sitzung archivieren
es: Archivar sesión
fr: Archiver la session

# sessionInfoArchiveSessionConfirm
source: Are you sure you want to archive this session?
de: Sind Sie sicher, dass Sie diese Sitzung archivieren möchten?
es: ¿Estás seguro de que deseas archivar esta sesión?
fr: Êtes-vous sûr de vouloir archiver cette session ?

# sessionInfoArchiveSessionSubtitle
source: Archive this session and stop it
de: Diese Sitzung archivieren und stoppen
es: Archivar esta sesión y detenerla
fr: Archiver cette session et l'arrêter

# sessionInfoDeleteSession
source: Delete Session
de: Sitzung löschen
es: Eliminar sesión
fr: Supprimer la session

# sessionInfoDeleteSessionSubtitle
source: Permanently remove this session
de: Diese Sitzung dauerhaft entfernen
es: Eliminar esta sesión permanentemente
fr: Supprimer définitivement cette session

# sessionInfoDeleteSessionConfirm
source: Delete Session Permanently?
de: Sitzung dauerhaft löschen?
es: ¿Eliminar sesión permanentemente?
fr: Supprimer la session définitivement ?

# sessionInfoDeleteSessionWarning
source: This action cannot be undone. All messages and data associated with this session will be permanently deleted.
de: Diese Aktion kann nicht rückgängig gemacht werden. Alle Nachrichten und Daten, die mit dieser Sitzung verbunden sind, werden dauerhaft gelöscht.
es: Esta acción no se puede deshacer. Todos los mensajes y datos asociados con esta sesión se eliminarán permanentemente.
fr: Cette action ne peut pas être annulée. Tous les messages et données associés à cette session seront définitivement supprimés.

# sessionInfoCopySessionId
source: Copy Session ID
de: Sitzungs-ID kopieren
es: Copiar ID de sesión
fr: Copier l'ID de session

# sessionInfoCopyMetadata
source: Copy Metadata
de: Metadaten kopieren
es: Copiar metadatos
fr: Copier les métadonnées

# sessionInfoSessionIdCopied
source: Session ID copied to clipboard
de: Sitzungs-ID in Zwischenablage kopiert
es: ID de sesión copiado al portapapeles
fr: ID de session copié dans le presse-papiers

# sessionInfoMetadataCopied
source: Metadata copied to clipboard
de: Metadaten in Zwischenablage kopiert
es: Metadatos copiados al portapapeles
fr: Métadonnées copiées dans le presse-papiers

# sessionInfoCopyFailed
source: Failed to copy to clipboard
de: Kopieren in Zwischenablage fehlgeschlagen
es: Error al copiar al portapapeles
fr: Échec de la copie dans le presse-papiers

# sessionInfoFailedToKillSession
source: Failed to kill session
de: Sitzungsbeendigung fehlgeschlagen
es: Error al terminar la sesión
fr: Échec de la terminaison de la session

# sessionInfoFailedToArchiveSession
source: Failed to archive session
de: Sitzungsarchivierung fehlgeschlagen
es: Error al archivar la sesión
fr: Échec de l'archivage de la session

# sessionInfoFailedToDeleteSession
source: Failed to delete session
de: Sitzungslöschung fehlgeschlagen
es: Error al eliminar la sesión
fr: Échec de la suppression de la session

# sessionInfoSessionDeleted
source: Session deleted successfully
de: Sitzung erfolgreich gelöscht
es: Sesión eliminada exitosamente
fr: Session supprimée avec succès

# machineTitle
source: Machine
es: Máquina

# machineLaunchNewSessionInDirectory
source: Launch New Session in Directory
es: Iniciar nueva sesión en directorio

# machineOfflineUnableToSpawn
source: Launcher disabled while machine is offline
es: Lanzador deshabilitado mientras la máquina está fuera de línea

# machineOfflineHelp
source: • Make sure your computer is online • Run `happy daemon status` to diagnose • Are you running the latest CLI version? Upgrade with `npm install -g happy-coder@latest`
es: • Asegúrate de que tu computadora esté en línea • Ejecuta `happy daemon status` para diagnosticar • ¿Estás ejecutando la última versión del CLI? Actualiza con `npm install -g happy-coder@latest`

# machineStatus
source: Status
es: Estado

# machineStopDaemon
source: Stop Daemon
es: Detener daemon

# machineLastKnownPid
source: Last Known PID
es: Último PID conocido

# machineLastKnownHttpPort
source: Last Known HTTP Port
es: Último puerto HTTP conocido

# machineStartedAt
source: Started At
es: Iniciado a las

# machineCliVersion
source: CLI Version
es: Versión de CLI

# machineDaemonStateVersion
source: Daemon State Version
es: Versión del estado del daemon

# machineActiveSessions
source: Active Sessions ({count})
es: Sesiones activas ({count})

# machineMachineGroup
source: Machine
es: Máquina

# machineMachineId
source: Machine ID
es: ID de máquina

# machineUsername
source: Username
es: Nombre de usuario

# machineHomeDirectory
source: Home Directory
es: Directorio de inicio

# machinePlatform
source: Platform
es: Plataforma

# machineArchitecture
source: Architecture
es: Arquitectura

# machineLastSeen
source: Last Seen
es: Última vez visto

# machineNever
source: Never
es: Nunca

# machineMetadataVersion
source: Metadata Version
es: Versión de metadatos

# machineUntitledSession
source: Untitled Session
es: Sesión sin título

# machineBack
source: Back
es: Atrás

# machineShowLess
source: Show less
es: Mostrar menos

# machineShowAll
source: Show all ({count} paths)
es: Mostrar todo ({count} rutas)

# machineEnterCustomPath
source: Enter custom path
es: Ingresar ruta personalizada

# machineOfflineUnableToSpawnNew
source: Unable to spawn new session, offline
es: No se puede crear nueva sesión, fuera de línea

# chatStartConversation
source: Start a conversation
de: Gespräch starten
es: Iniciar una conversación
fr: Démarrer une conversation

# chatSendMessageToBegin
source: Send a message to begin
de: Senden Sie eine Nachricht zum Beginnen
es: Envía un mensaje para comenzar
fr: Envoyez un message pour commencer

# chatSessionSettings
source: Session settings
de: Sitzungseinstellungen
es: Configuración de sesión
fr: Paramètres de session

# chatDeleteSession
source: Delete session
de: Sitzung löschen
es: Eliminar sesión
fr: Supprimer la session

# chatDeleteSessionConfirm
source: Are you sure you want to delete this session?
de: Sind Sie sicher, dass Sie diese Sitzung löschen möchten?
es: ¿Estás seguro de que deseas eliminar esta sesión?
fr: Êtes-vous sûr de vouloir supprimer cette session ?
