Repository: denysvitali/happy_flutter
Catalog: l10n/app_*.arb
Languages: de, es, fr

# toolDescGrepPattern
source: grep(pattern: {pattern})
de: grep(Muster: {pattern})
es: grep(patrón: {pattern})
fr: grep(motif: {pattern})

# toolDescMultiEditEdits
source: {path} ({count} edits)
de: {path} ({count} Bearbeitungen)
es: {path} ({count} ediciones)
fr: {path} ({count} modifications)

# toolDescReadingFile
source: Reading {file}
de: Lese {file}
es: Leyendo {file}
fr: Lecture de {file}

# toolDescWritingFile
source: Writing {file}
de: Schreibe {file}
es: Escribiendo {file}
fr: Écriture de {file}

# toolDescModifyingFile
source: Modifying {file}
de: Ändere {file}
es: Modificando {file}
fr: Modification de {file}

# toolDescModifyingFiles
source: Modifying {count} files
de: Ändere {count} Dateien
es: Modificando {count} archivos
fr: Modification de {count} fichiers

# toolDescModifyingMultipleFiles
source: {file} and {count} more
de: {file} und {count} weitere
es: {file} y {count} más
fr: {file} et {count} autres

# toolDescShowingDiff
source: Showing changes
de: Zeige Änderungen
es: Mostrando cambios
fr: Affichage des modifications

# filesSearchPlaceholder
source: Search files...
de: Dateien suchen...
es: Buscar archivos...
fr: Rechercher des fichiers...

# filesDetachedHead
source: detached HEAD
es: HEAD separado
fr: HEAD détaché

# filesSummary
source: {staged} staged • {unstaged} unstaged
de: {staged} bereitgestellt • {unstaged} nicht bereitgestellt
es: {staged} en etapas • {unstaged} sin etapas
fr: {staged} indexés • {unstaged} non indexés

# filesNotRepo
source: Not a git repository
de: Kein Git-Repository
es: No es un repositorio git
fr: Pas un dépôt git

# filesNotUnderGit
source: This directory is not under git version control
de: Dieses Verzeichnis ist nicht unter Git-Versionskontrolle
es: Este directorio no está bajo control de versiones git
fr: Ce répertoire n'est pas sous contrôle de version git

# filesSearching
source: Searching files...
de: Dateien werden gesucht...
es: Buscando archivos...
fr: Recherche de fichiers...

# filesNoFilesFound
source: No files found
de: Keine Dateien gefunden
es: No se encontraron archivos
fr: Aucun fichier trouvé

# filesNoFilesInProject
source: No files in project
de: Keine Dateien im Projekt
es: No hay archivos en el proyecto
fr: Aucun fichier dans le projet

# filesTryDifferentTerm
source: Try a different search term
de: Versuchen Sie einen anderen Suchbegriff
es: Prueba con un término de búsqueda diferente
fr: Essayez un terme de recherche différent

# filesSearchResults
source: Search Results ({count})
de: Suchergebnisse ({count})
es: Resultados de búsqueda ({count})
fr: Résultats de recherche ({count})

# filesProjectRoot
source: Project root
de: Projektstamm
es: Raíz del proyecto
fr: Racine du projet

# filesStagedChanges
source: Staged Changes ({count})
de: Bereitgestellte Änderungen ({count})
es: Cambios en etapas ({count})
fr: Modifications indexées ({count})

# filesUnstagedChanges
source: Unstaged Changes ({count})
de: Nicht bereitgestellte Änderungen ({count})
es: Cambios sin etapas ({count})
fr: Modifications non indexées ({count})

# filesLoadingFile
source: Loading {fileName}...
de: Lade {fileName}...
es: Cargando {fileName}...
fr: Chargement de {fileName}...

# filesBinaryFile
source: Binary File
de: Binärdatei
es: Archivo binario
fr: Fichier binaire

# filesCannotDisplayBinary
source: Cannot display binary file content
de: Binäredateiinhalt kann nicht angezeigt werden
es: No se puede mostrar el contenido del archivo binario
fr: Impossible d'afficher le contenu du fichier binaire

# filesFile
source: File
de: Datei
es: Archivo
fr: Fichier

# filesFileEmpty
source: File is empty
de: Datei ist leer
es: El archivo está vacío
fr: Le fichier est vide

# filesNoChanges
source: No changes to display
de: Keine Änderungen anzuzeigen
es: No hay cambios para mostrar
fr: Aucune modification à afficher

# profileUserProfile
source: User Profile
de: Benutzerprofil
es: Perfil de usuario
fr: Profil utilisateur

# profileDetails
source: Details
es: Detalles
fr: Détails

# profileFirstName
source: First Name
de: Vorname
es: Nombre
fr: Prénom

# profileLastName
source: Last Name
de: Nachname
es: Apellido
fr: Nom

# profileUsername
source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur

# profileStatus
source: Status
es: Estado
fr: État

# agentPermissionModeTitle
source: PERMISSION MODE
de: BERECHTIGUNGSMODUS
es: MODO DE PERMISO
fr: MODE D'AUTORISATION

# agentPermissionModeDefault
source: Default
de: Standard
es: Predeterminado
fr: Par défaut

# agentPermissionModeAcceptEdits
source: Accept Edits
de: Bearbeitungen akzeptieren
es: Aceptar ediciones
fr: Accepter les modifications

# agentPermissionModePlan
source: Plan Mode
de: Planmodus
es: Modo plan
fr: Mode plan

# agentPermissionModeBypassPermissions
source: Yolo Mode
de: Yolo-Modus
es: Modo Yolo
fr: Mode Yolo

# agentPermissionModeBadgeAcceptAllEdits
source: Accept All Edits
de: Alle Bearbeitungen akzeptieren
es: Aceptar todas las ediciones
fr: Accepter toutes les modifications

# agentPermissionModeBadgeBypassAllPermissions
source: Bypass All Permissions
de: Alle Berechtigungen umgehen
es: Omitir todos los permisos
fr: Passer toutes les autorisations

# agentPermissionModeBadgePlanMode
source: Plan Mode
de: Planmodus
es: Modo plan
fr: Mode plan

# agentModelTitle
source: MODEL
de: MODELL
es: MODELO
fr: MODÈLE

# agentModelConfigureInCli
source: Configure models in CLI settings
de: Modelle in CLI-Einstellungen konfigurieren
es: Configura modelos en la configuración del CLI
fr: Configurez les modèles dans les paramètres CLI

# agentContextRemaining
source: {percent}% left
de: {percent}% verbleibend
es: {percent}% restante
fr: {percent}% restant

# agentSuggestionFileLabel
source: FILE
de: DATEI
es: ARCHIVO
fr: FICHIER

# agentSuggestionFolderLabel
source: FOLDER
de: ORDNER
es: CARPETA
fr: DOSSIER

# agentNoMachinesAvailable
source: No machines
de: Keine Maschinen verfügbar
es: Sin máquinas disponibles
fr: Aucune machine disponible

# updateBannerUpdateAvailable
source: Update available
de: Update verfügbar
es: Actualización disponible
fr: Mise à jour disponible

# updateBannerPressToApply
source: Press to apply the update
de: Drücken Sie, um das Update anzuwenden
es: Presiona para aplicar la actualización
fr: Appuyez pour appliquer la mise à jour

# updateBannerWhatsNew
source: What's new
de: Was ist neu
es: Novedades
fr: Nouveautés

# updateBannerSeeLatest
source: See the latest updates and improvements
de: Die neuesten Updates und Verbesserungen ansehen
es: Ver las últimas actualizaciones y mejoras
fr: Voir les dernières mises à jour et améliorations

# updateBannerNativeUpdateAvailable
source: App Update Available
de: App-Update verfügbar
es: Actualización de aplicación disponible
fr: Mise à jour de l'application disponible

# updateBannerTapToUpdateAppStore
source: Tap to update in App Store
de: Tippen Sie zum Update im App Store
es: Toca para actualizar en App Store
fr: Appuyez pour mettre à jour sur l'App Store

# updateBannerTapToUpdatePlayStore
source: Tap to update in Play Store
de: Tippen Sie zum Update im Play Store
es: Toca para actualizar en Play Store
fr: Appuyez pour mettre à jour sur le Play Store

# changelogVersion
source: Version {version}
es: Versión {version}

# changelogNoEntriesAvailable
source: No changelog entries available.
de: Keine Changelog-Einträge verfügbar.
es: No hay entradas de registro de cambios disponibles.
fr: Aucune entrée de journal des modifications disponible.

# modalsAuthenticateTerminal
source: Authenticate Terminal
de: Terminal authentifizieren
es: Autenticar terminal
fr: Authentifier le terminal

# modalsPasteUrlFromTerminal
source: Paste the authentication URL from your terminal
de: Fügen Sie die Authentifizierungs-URL von Ihrem Terminal ein
es: Pega la URL de autenticación de tu terminal
fr: Collez l'URL d'authentification de votre terminal

# modalsDeviceLinkedSuccessfully
source: Device linked successfully
de: Gerät erfolgreich verknüpft
es: Dispositivo vinculado exitosamente
fr: Appareil lié avec succès

# modalsTerminalConnectedSuccessfully
source: Terminal connected successfully
de: Terminal erfolgreich verbunden
es: Terminal conectada exitosamente
fr: Terminal connecté avec succès

# modalsInvalidAuthUrl
source: Invalid authentication URL
de: Ungültige Authentifizierungs-URL
es: URL de autenticación inválida
fr: URL d'authentification invalide

# modalsDeveloperMode
source: Developer Mode
de: Entwicklermodus
es: Modo desarrollador
fr: Mode développeur

# modalsDeveloperModeEnabled
source: Developer mode enabled
de: Entwicklermodus aktiviert
es: Modo desarrollador habilitado
fr: Mode développeur activé

# modalsDeveloperModeDisabled
source: Developer mode disabled
de: Entwicklermodus deaktiviert
es: Modo desarrollador deshabilitado
fr: Mode développeur désactivé

# modalsDisconnectGithub
source: Disconnect GitHub
de: GitHub trennen
es: Desconectar GitHub
fr: Déconnecter GitHub

# modalsDisconnectGithubConfirm
source: Are you sure you want to disconnect your GitHub account?
de: Sind Sie sicher, dass Sie Ihr GitHub-Konto trennen möchten?
es: ¿Estás seguro de que deseas desconectar tu cuenta de GitHub?
fr: Êtes-vous sûr de vouloir déconnecter votre compte GitHub ?

# modalsDisconnectService
source: Disconnect {service}
de: {service} trennen
es: Desconectar {service}
fr: Déconnecter {service}

# modalsDisconnectServiceConfirm
source: Are you sure you want to disconnect {service} from your account?
de: Sind Sie sicher, dass Sie {service} von Ihrem Konto trennen möchten?
es: ¿Estás seguro de que deseas desconectar {service} de tu cuenta?
fr: Êtes-vous sûr de vouloir déconnecter {service} de votre compte ?

# modalsDisconnect
source: Disconnect
de: Trennen
es: Desconectar
fr: Déconnecter

# modalsFailedToConnectTerminal
source: Failed to connect terminal
de: Verbinden des Terminals fehlgeschlagen
es: Error al conectar terminal
fr: Échec de la connexion au terminal

# modalsCameraPermissionsRequiredToConnectTerminal
source: Camera permissions are required to connect terminal
de: Kameraberechtigungen erforderlich, um das Terminal zu verbinden
es: Se requieren permisos de cámara para conectar la terminal
fr: Les permissions de caméra sont requises pour connecter le terminal

# modalsFailedToLinkDevice
source: Failed to link device
de: Verknüpfen des Geräts fehlgeschlagen
es: Error al vincular dispositivo
fr: Échec de la liaison de l'appareil

# navigationConnectTerminal
source: Connect Terminal
de: Terminal verbinden
es: Conectar terminal
fr: Connecter le terminal

# navigationLinkNewDevice
source: Link New Device
de: Neues Gerät verknüpfen
es: Vincular nuevo dispositivo
fr: Lier un nouvel appareil

# navigationRestoreWithSecretKey
source: Restore with Secret Key
de: Mit geheimem Schlüssel wiederherstellen
es: Restaurar con clave secreta
fr: Restaurer avec la clé secrète

# navigationWhatsNew
source: What's New
de: Was ist neu
es: Novedades
fr: Nouveautés

# navigationFriends
source: Friends
de: Freunde
es: Amigos
fr: Amis

# emptyMainScreenReadyToCode
source: Ready to code?
de: Bereit zum Programmieren?
es: ¿Listo para programar?
fr: Prêt à coder ?

# emptyMainScreenInstallCli
source: Install the Happy CLI
de: Installieren Sie das Happy-CLI
es: Instala el CLI de Happy
fr: Installez le CLI Happy

# emptyMainScreenRunIt
source: Run it
de: Führen Sie es aus
es: Ejecútalo
fr: Exécutez-le

# emptyMainScreenScanQrCode
source: Scan the QR code
de: QR-Code scannen
es: Escanea el código QR
fr: Scannez le code QR

# emptyMainScreenOpenCamera
source: Open Camera
de: Kamera öffnen
es: Abrir cámara
fr: Ouvrir la caméra

# reviewEnjoyingApp
source: Enjoying the app?
de: Gefällt Ihnen die App?
es: ¿Te gusta la aplicación?
fr: Vous aimez l'application ?

# reviewFeedbackPrompt
source: We'd love to hear your feedback!
de: Wir freuen uns über Ihr Feedback!
es: ¡Nos encantaría recibir tus comentarios!
fr: Nous aimerions avoir vos commentaires !

# reviewYesILoveIt
source: Yes, I love it!
de: Ja, ich liebe es!
es: ¡Sí, me encanta!
fr: Oui, j'adore !

# reviewNotReally
source: Not really
de: Nicht wirklich
es: No realmente
fr: Pas vraiment

# itemsCopiedToClipboard
source: {label} copied to clipboard
de: {label} in Zwischenablage kopiert
es: {label} copiado al portapapeles
fr: {label} copié dans le presse-papiers

# messageSwitchedToMode
source: Switched to {mode} mode
de: Gewechselt zu {mode}-Modus
es: Cambiado a modo {mode}
fr: Passé en mode {mode}

# messageUnknownEvent
source: Unknown event
de: Unbekanntes Ereignis
es: Evento desconocido
fr: Événement inconnu

# messageUsageLimitUntil
source: Usage limit reached until {time}
de: Nutzungsgrenze erreicht bis {time}
es: Límite de uso alcanzado hasta {time}
fr: Limite d'utilisation atteinte jusqu'à {time}

# messageUnknownTime
source: unknown time
de: unbekannte Zeit
es: hora desconocida
fr: heure inconnue

# codexPermissionsYesForSession
source: Yes, and don't ask for a session
de: Ja, und nicht für eine Sitzung fragen
es: Sí, y no preguntar para una sesión
fr: Oui, et ne pas demander pour une session

# codexPermissionsStopAndExplain
source: Stop, and explain what to do
de: Stoppen und erklären, was zu tun ist
es: Detener y explicar qué hacer
fr: Arrêter, et expliquer quoi faire

# claudePermissionsYesAllowAllEdits
source: Yes, allow all edits during this session
de: Ja, alle Bearbeitungen während dieser Sitzung erlauben
es: Sí, permitir todas las ediciones durante esta sesión
fr: Oui, autoriser toutes les modifications pendant cette session

# claudePermissionsYesForTool
source: Yes, don't ask again for this tool
de: Ja, für dieses Tool nicht erneut fragen
es: Sí, no preguntar de nuevo para esta herramienta
fr: Oui, ne pas demander à nouveau pour cet outil

# claudePermissionsNoTellClaude
source: No, and provide feedback
de: Nein, und Feedback geben
es: No, y proporcionar comentarios
fr: Non, et fournir des commentaires

# textSelectionSelectText
source: Select text range
de: Textbereich auswählen
es: Seleccionar rango de texto
fr: Sélectionner la plage de texte

# textSelectionTitle
source: Select Text
de: Text auswählen
es: Seleccionar texto
fr: Sélectionner le texte

# textSelectionNoTextProvided
source: No text provided
de: Kein Text bereitgestellt
es: No se proporcionó texto
fr: Aucun texte fourni

# textSelectionTextNotFound
source: Text not found or expired
de: Text nicht gefunden oder abgelaufen
es: Texto no encontrado o expirado
fr: Texte non trouvé ou expiré

# textSelectionTextCopied
source: Text copied to clipboard
de: Text in Zwischenablage kopiert
es: Texto copiado al portapapeles
fr: Texte copié dans le presse-papiers

# textSelectionFailedToCopy
source: Failed to copy text to clipboard
de: Kopieren des Textes in Zwischenablage fehlgeschlagen
es: Error al copiar texto al portapapeles
fr: Échec de la copie du texte dans le presse-papiers

# textSelectionNoTextToCopy
source: No text available to copy
de: Kein Text zum Kopieren verfügbar
es: No hay texto disponible para copiar
fr: Aucun texte disponible à copier

# markdownCodeCopied
source: Code copied
de: Code kopiert
es: Código copiado
fr: Code copié

# markdownCopyFailed
source: Copy failed
de: Kopieren fehlgeschlagen
es: Error al copiar
fr: Échec de la copie

# markdownMermaidRenderFailed
source: Failed to render mermaid diagram
de: Rendern des Mermaid-Diagramms fehlgeschlagen
es: Error al renderizar diagrama de mermaid
fr: Échec du rendu du diagramme mermaid

# artifactsTitle
source: Artifacts
de: Artefakte
es: Artefactos
fr: Artefacts

# artifactsCountSingular
source: 1 artifact
de: 1 Artefakt
es: 1 artefacto
fr: 1 artefact

# artifactsCountPlural
source: {count} artifacts
de: {count} Artefakte
es: {count} artefactos
fr: {count} artefacts

# artifactsEmpty
source: No artifacts yet
de: Noch keine Artefakte
es: Aún no hay artefactos
fr: Pas encore d'artefacts

# artifactsEmptyDescription
source: Create your first artifact to get started
de: Erstellen Sie Ihr erstes Artefakt, um zu beginnen
es: Crea tu primer artefacto para comenzar
fr: Créez votre premier artefact pour commencer

# artifactsNew
source: New Artifact
de: Neues Artefakt
es: Nuevo artefacto
fr: Nouvel artefact

# artifactsEdit
source: Edit Artifact
de: Artefakt bearbeiten
es: Editar artefacto
fr: Modifier l'artefact

# artifactsDelete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer

# artifactsUpdateError
source: Failed to update artifact. Please try again.
de: Aktualisieren des Artefakts fehlgeschlagen. Bitte erneut versuchen.
es: Error al actualizar artefacto. Por favor intenta de nuevo.
fr: Échec de la mise à jour de l'artefact. Veuillez réessayer.

# artifactsNotFound
source: Artifact not found
de: Artefakt nicht gefunden
es: Artefacto no encontrado
fr: Artefact non trouvé

# artifactsDiscardChanges
source: Discard changes?
de: Änderungen verwerfen?
es: ¿Descartar cambios?
fr: Ignorer les modifications ?

# artifactsDiscardChangesDescription
source: You have unsaved changes. Are you sure you want to discard them?
de: Sie haben nicht gespeicherte Änderungen. Sind Sie sicher, dass Sie sie verwerfen möchten?
es: Tienes cambios sin guardar. ¿Estás seguro de que deseas descartarlos?
fr: Vous avez des modifications non enregistrées. Êtes-vous sûr de vouloir les ignorer ?

# artifactsDeleteConfirm
source: Delete artifact?
de: Artefakt löschen?
es: ¿Eliminar artefacto?
fr: Supprimer l'artefact ?

# artifactsDeleteConfirmDescription
source: This action cannot be undone
de: Diese Aktion kann nicht rückgängig gemacht werden
es: Esta acción no se puede deshacer
fr: Cette action ne peut pas être annulée

# artifactsTitleLabel
source: TITLE
de: TITEL
es: TÍTULO
fr: TITRE

# artifactsTitlePlaceholder
source: Enter a title for your artifact
de: Titel für Ihr Artefakt eingeben
es: Ingresa un título para tu artefacto
fr: Entrez un titre pour votre artefact

# artifactsBodyLabel
source: CONTENT
de: INHALT
es: CONTENIDO
fr: CONTENU

# artifactsBodyPlaceholder
source: Write your content here...
de: Schreiben Sie Ihren Inhalt hier...
es: Escribe tu contenido aquí...
fr: Écrivez votre contenu ici...

# artifactsEmptyFieldsError
source: Please enter a title or content
de: Bitte geben Sie einen Titel oder Inhalt ein
es: Por favor ingresa un título o contenido
fr: Veuillez entrer un titre ou un contenu

# artifactsCreateError
source: Failed to create artifact. Please try again.
de: Erstellen des Artefakts fehlgeschlagen. Bitte erneut versuchen.
es: Error al crear artefacto. Por favor intenta de nuevo.
fr: Échec de la création de l'artefact. Veuillez réessayer.

# artifactsSave
source: Save
de: Speichern
es: Guardar
fr: Enregistrer

# artifactsSaving
source: Saving...
de: Speichern...
es: Guardando...
fr: Enregistrement...

# artifactsLoading
source: Loading artifacts...
de: Artefakte werden geladen...
es: Cargando artefactos...
fr: Chargement des artefacts...

# artifactsError
source: Failed to load artifact
de: Laden des Artefakts fehlgeschlagen
es: Error al cargar artefacto
fr: Échec du chargement de l'artefact

# friendsTitle
source: Friends
de: Freunde
es: Amigos
fr: Amis

# friendsManageFriends
source: Manage your friends and connections
de: Verwalten Sie Ihre Freunde und Verbindungen
es: Administra tus amigos y conexiones
fr: Gérez vos amis et connexions

# friendsSearchTitle
source: Find Friends
de: Freunde finden
es: Buscar amigos
fr: Trouver des amis

# friendsPendingRequests
source: Friend Requests
de: Freundschaftsanfragen
es: Solicitudes de amistad
fr: Demandes d'ami

# friendsMyFriends
source: My Friends
de: Meine Freunde
es: Mis amigos
fr: Mes amis

# friendsNoFriendsYet
source: You don't have any friends yet
de: Sie haben noch keine Freunde
es: Aún no tienes amigos
fr: Vous n'avez pas encore d'amis

# friendsFindFriends
source: Find Friends
de: Freunde finden
es: Buscar amigos
fr: Trouver des amis

# friendsRemove
source: Remove
de: Entfernen
es: Eliminar
fr: Supprimer

# friendsPendingRequest
source: Pending
de: Ausstehend
es: Pendiente
fr: En attente

# friendsSentOn
source: Sent on {date}
de: Gesendet am {date}
es: Enviado el {date}
fr: Envoyé le {date}

# friendsAccept
source: Accept
de: Akzeptieren
es: Aceptar
fr: Accepter

# friendsReject
source: Reject
de: Ablehnen
es: Rechazar
fr: Rejeter

# friendsAddFriend
source: Add Friend
de: Freund hinzufügen
es: Agregar amigo
fr: Ajouter un ami

# friendsAlreadyFriends
source: Already Friends
de: Bereits Freunde
es: Ya son amigos
fr: Déjà amis

# friendsRequestPending
source: Request Pending
de: Anfrage ausstehend
es: Solicitud pendiente
fr: Demande en attente

# friendsSearchInstructions
source: Enter a username to search for friends
de: Geben Sie einen Benutzernamen ein, um nach Freunden zu suchen
es: Ingresa un nombre de usuario para buscar amigos
fr: Entrez un nom d'utilisateur pour rechercher des amis

# friendsSearchPlaceholder
source: Enter username...
de: Benutzername eingeben...
es: Ingresa nombre de usuario...
fr: Entrez le nom d'utilisateur...

# friendsSearching
source: Searching...
de: Suchen...
es: Buscando...
fr: Recherche...

# friendsUserNotFound
source: User not found
de: Benutzer nicht gefunden
es: Usuario no encontrado
fr: Utilisateur non trouvé

# friendsNoUserFound
source: No user found with that username
de: Kein Benutzer mit diesem Benutzernamen gefunden
es: No se encontró ningún usuario con ese nombre de usuario
fr: Aucun utilisateur trouvé avec ce nom d'utilisateur

# friendsCheckUsername
source: Please check the username and try again
de: Bitte überprüfen Sie den Benutzernamen und versuchen Sie es erneut
es: Por favor verifica el nombre de usuario e intenta de nuevo
fr: Veuillez vérifier le nom d'utilisateur et réessayer

# friendsHowToFind
source: How to Find Friends
de: Wie man Freunde findet
es: Cómo encontrar amigos
fr: Comment trouver des amis

# friendsFindInstructions
source: Search for friends by their username. Both you and your friend need to have GitHub connected to send friend requests.
de: Suchen Sie nach Freunden nach ihrem Benutzernamen. Sowohl Sie als auch Ihr Freund müssen GitHub verbunden haben, um Freundschaftsanfragen zu senden.
es: Busca amigos por su nombre de usuario. Tanto tú como tu amigo necesitan tener GitHub conectado para enviar solicitudes de amistad.
fr: Recherchez des amis par leur nom d'utilisateur. Vous et votre ami devez avoir GitHub connecté pour envoyer des demandes d'ami.

# friendsRequestSent
source: Friend request sent!
de: Freundschaftsanfrage gesendet!
es: ¡Solicitud de amistad enviada!
fr: Demande d'ami envoyée !

# friendsRequestAccepted
source: Friend request accepted!
de: Freundschaftsanfrage akzeptiert!
es: ¡Solicitud de amistad aceptada!
fr: Demande d'ami acceptée !

# friendsRequestRejected
source: Friend request rejected
de: Freundschaftsanfrage abgelehnt
es: Solicitud de amistad rechazada
fr: Demande d'ami rejetée

# friendsFriendRemoved
source: Friend removed
de: Freund entfernt
es: Amigo eliminado
fr: Ami supprimé

# friendsConfirmRemove
source: Remove Friend
de: Freund entfernen
es: Eliminar amigo
fr: Supprimer l'ami

# friendsConfirmRemoveMessage
source: Are you sure you want to remove this friend?
de: Sind Sie sicher, dass Sie diesen Freund entfernen möchten?
es: ¿Estás seguro de que deseas eliminar a este amigo?
fr: Êtes-vous sûr de vouloir supprimer cet ami ?

# friendsCannotAddYourself
source: You cannot send a friend request to yourself
de: Sie können keine Freundschaftsanfrage an sich selbst senden
es: No puedes enviar una solicitud de amistad a ti mismo
fr: Vous ne pouvez pas vous envoyer une demande d'ami

# friendsBothMustHaveGithub
source: Both users must have GitHub connected to become friends
de: Beide Benutzer müssen GitHub verbunden haben, um Freunde zu werden
es: Ambos usuarios deben tener GitHub conectado para ser amigos
fr: Les deux utilisateurs doivent avoir GitHub connecté pour devenir amis
