Repository: denysvitali/happy_flutter
Catalog: l10n/app_*.arb
Languages: de, es, fr

# settingsServerCustomServerUrlLabel
source: Custom Server URL
de: Benutzerdefinierte Server-URL
es: URL del servidor personalizado
fr: URL du serveur personnalisé

# settingsServerAdvancedFeatureFooter
source: This is an advanced feature. Only change the server if you know what you're doing. You will need to log out and log in again after changing servers.
de: Dies ist eine erweiterte Funktion. Ändern Sie den Server nur, wenn Sie wissen, was Sie tun. Sie müssen sich ab- und wieder anmelden, nachdem Sie die Server geändert haben.
es: Esta es una característica avanzada. Solo cambia el servidor si sabes lo que estás haciendo. Necesitarás cerrar sesión e iniciar sesión nuevamente después de cambiar de servidor.
fr: C'est une fonctionnalité avancée. Ne changez le serveur que si vous savez ce que vous faites. Vous devrez vous déconnecter et vous reconnecter après avoir changé de serveur.

# settingsVoiceTitle
source: Voice Assistant
de: Sprachassistent
es: Asistente de voz
fr: Assistant vocal

# settingsVoiceLanguage
source: Language
de: Sprache
es: Idioma
fr: Langue

# settingsVoiceLanguageSubtitle
source: Choose your preferred language for voice assistant interactions. This setting syncs across all your devices.
de: Wählen Sie Ihre bevorzugte Sprache für Sprachassistent-Interaktionen. Diese Einstellung wird auf allen Ihren Geräten synchronisiert.
es: Elige tu idioma preferido para las interacciones del asistente de voz. Esta configuración se sincroniza en todos tus dispositivos.
fr: Choisissez votre langue préférée pour les interactions avec l'assistant vocal. Ce paramètre se synchronise sur tous vos appareils.

# settingsVoicePreferredLanguage
source: Preferred Language
de: Bevorzugte Sprache
es: Idioma preferido
fr: Langue préférée

# settingsVoicePreferredLanguageSubtitle
source: Language used for voice assistant responses
de: Sprache, die für Sprachassistent-Antworten verwendet wird
es: Idioma usado para respuestas del asistente de voz
fr: Langue utilisée pour les réponses de l'assistant vocal

# settingsVoiceLanguageSearchPlaceholder
source: Search languages...
de: Sprachen suchen...
es: Buscar idiomas...
fr: Rechercher des langues...

# settingsVoiceLanguageSearchTitle
source: Languages
de: Sprachen
es: Idiomas
fr: Langues

# settingsVoiceLanguageFooter
source: {count, plural, =1 {1 language} other {{count} languages}} available
de: {count, plural, =1 {1 Sprache} other {{count} Sprachen}} verfügbar
es: {count, plural, =1 {1 idioma} other {{count} idiomas}} disponibles
fr: {count, plural, =1 {1 langue} other {{count} langues}} disponible(s)

# settingsVoiceLanguageAutoDetect
source: Auto-detect
de: Automatisch erkennen
es: Detección automática
fr: Détection automatique

# settingsProfilesTitle
source: Profiles
de: Profile
es: Perfiles
fr: Profils

# settingsProfilesNoProfile
source: No Profile
de: Kein Profil
es: Sin perfil
fr: Aucun profil

# settingsProfilesNoProfileDescription
source: Use default environment settings
de: Standard-Umgebungseinstellungen verwenden
es: Usar configuración de entorno predeterminada
fr: Utiliser les paramètres d'environnement par défaut

# settingsProfilesDefaultModel
source: Default Model
de: Standardmodell
es: Modelo predeterminado
fr: Modèle par défaut

# settingsProfilesAddProfile
source: Add Profile
de: Profil hinzufügen
es: Agregar perfil
fr: Ajouter un profil

# settingsProfilesProfileName
source: Profile Name
de: Profilname
es: Nombre del perfil
fr: Nom du profil

# settingsProfilesEnterName
source: Enter profile name
de: Profilnamen eingeben
es: Ingresa el nombre del perfil
fr: Entrez le nom du profil

# settingsProfilesBaseUrl
source: Base URL
de: Basis-URL
es: URL base
fr: URL de base

# settingsProfilesAuthToken
source: Auth Token
de: Authentifizierungstoken
es: Token de autenticación
fr: Jeton d'authentification

# settingsProfilesEnterToken
source: Enter auth token
de: Authentifizierungstoken eingeben
es: Ingresa el token de autenticación
fr: Entrez le jeton d'authentification

# settingsProfilesModel
source: Model
de: Modell
es: Modelo
fr: Modèle

# settingsProfilesTmuxSession
source: Tmux Session
de: Tmux-Sitzung
es: Sesión de Tmux
fr: Session Tmux

# settingsProfilesEnterTmuxSession
source: Enter tmux session name
de: Tmux-Sitzungsnamen eingeben
es: Ingresa el nombre de la sesión de tmux
fr: Entrez le nom de la session tmux

# settingsProfilesTmuxTempDir
source: Tmux Temp Directory
de: Tmux-Temp-Verzeichnis
es: Directorio temporal de Tmux
fr: Répertoire temporaire Tmux

# settingsProfilesEnterTmuxTempDir
source: Enter temp directory path
de: Temporären Verzeichnispfad eingeben
es: Ingresa la ruta del directorio temporal
fr: Entrez le chemin du répertoire temporaire

# settingsProfilesTmuxUpdateEnvironment
source: Update environment automatically
de: Umgebung automatisch aktualisieren
es: Actualizar entorno automáticamente
fr: Mettre à jour l'environnement automatiquement

# settingsProfilesNameRequired
source: Profile name is required
de: Profilname ist erforderlich
es: El nombre del perfil es requerido
fr: Le nom du profil est requis

# settingsProfilesDeleteConfirm
source: Are you sure you want to delete the profile "{name}"?
de: Sind Sie sicher, dass Sie das Profil "{name}" löschen möchten?
es: ¿Estás seguro de que deseas eliminar el perfil "{name}"?
fr: Êtes-vous sûr de vouloir supprimer le profil "{name}" ?

# settingsProfilesEditProfile
source: Edit Profile
de: Profil bearbeiten
es: Editar perfil
fr: Modifier le profil

# settingsProfilesAddProfileTitle
source: Add New Profile
de: Neues Profil hinzufügen
es: Agregar nuevo perfil
fr: Ajouter un nouveau profil

# settingsProfilesDeleteTitle
source: Delete Profile
de: Profil löschen
es: Eliminar perfil
fr: Supprimer le profil

# settingsProfilesDeleteMessage
source: Are you sure you want to delete "{name}"? This action cannot be undone.
de: Sind Sie sicher, dass Sie "{name}" löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Estás seguro de que deseas eliminar "{name}"? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer "{name}" ? Cette action ne peut pas être annulée.

# settingsProfilesDeleteConfirmAction
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer

# settingsProfilesDeleteCancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler

# settingsUsageTitle
source: Usage
de: Nutzung
es: Uso
fr: Utilisation

# settingsUsageToday
source: Today
de: Heute
es: Hoy
fr: Aujourd'hui

# settingsUsageLast7Days
source: Last 7 days
de: Letzte 7 Tage
es: Últimos 7 días
fr: 7 derniers jours

# settingsUsageLast30Days
source: Last 30 days
de: Letzte 30 Tage
es: Últimos 30 días
fr: 30 derniers jours

# settingsUsageTotalTokens
source: Total Tokens
de: Gesamte Tokens
es: Tokens totales
fr: Jetons totaux

# settingsUsageTotalCost
source: Total Cost
de: Gesamtkosten
es: Costo total
fr: Coût total

# settingsUsageCost
source: Cost
de: Kosten
es: Costo
fr: Coût

# settingsUsageUsageOverTime
source: Usage over time
de: Nutzung über die Zeit
es: Uso a lo largo del tiempo
fr: Utilisation au fil du temps

# settingsUsageByModel
source: By Model
de: Nach Modell
es: Por modelo
fr: Par modèle

# settingsUsageNoData
source: No usage data available
de: Keine Nutzungsdaten verfügbar
es: No hay datos de uso disponibles
fr: Aucune donnée d'utilisation disponible

# settingsDeveloperTitle
source: Developer
de: Entwickler
es: Desarrollador
fr: Développeur

# settingsDeveloperVersion
source: Version {version}
es: Versión {version}

# settingsDeveloperCopyDebugInfo
source: Copy Debug Info
de: Debug-Info kopieren
es: Copiar información de depuración
fr: Copier les infos de débogage

# settingsDeveloperDebugInfoCopied
source: Debug info copied to clipboard
de: Debug-Info in Zwischenablage kopiert
es: Información de depuración copiada al portapapeles
fr: Infos de débogage copiées dans le presse-papiers

# errorsNetworkError
source: Network error occurred
de: Netzwerkfehler aufgetreten
es: Error de red ocurrido
fr: Erreur réseau survenue

# errorsServerError
source: Server error occurred
de: Serverfehler aufgetreten
es: Error de servidor ocurrido
fr: Erreur de serveur survenue

# errorsUnknownError
source: An unknown error occurred
de: Ein unbekannter Fehler ist aufgetreten
es: Ocurrió un error desconocido
fr: Une erreur inconnue est survenue

# errorsConnectionTimeout
source: Connection timed out
de: Verbindung timed out
es: Conexión expiró
fr: Connexion expirée

# errorsAuthenticationFailed
source: Authentication failed
de: Authentifizierung fehlgeschlagen
es: Autenticación fallida
fr: Échec de l'authentification

# errorsPermissionDenied
source: Permission denied
de: Berechtigung verweigert
es: Permiso denegado
fr: Permission refusée

# errorsFileNotFound
source: File not found
de: Datei nicht gefunden
es: Archivo no encontrado
fr: Fichier non trouvé

# errorsInvalidFormat
source: Invalid format
de: Ungültiges Format
es: Formato inválido
fr: Format invalide

# errorsOperationFailed
source: Operation failed
de: Operation fehlgeschlagen
es: Operación fallida
fr: Échec de l'opération

# errorsTryAgain
source: Please try again
de: Bitte erneut versuchen
es: Por favor intenta de nuevo
fr: Veuillez réessayer

# errorsContactSupport
source: Contact support if the problem persists
de: Kontaktieren Sie den Support, falls das Problem weiterhin besteht
es: Contacta soporte si el problema persiste
fr: Contactez le support si le problème persiste

# errorsSessionNotFound
source: Session not found
de: Sitzung nicht gefunden
es: Sesión no encontrada
fr: Session non trouvée

# errorsVoiceSessionFailed
source: Failed to start voice session
de: Starten der Sprachsitzung fehlgeschlagen
es: Error al iniciar sesión de voz
fr: Échec du démarrage de la session vocale

# errorsVoiceServiceUnavailable
source: Voice service is temporarily unavailable
de: Sprachdienst vorübergehend nicht verfügbar
es: El servicio de voz está temporalmente no disponible
fr: Le service vocal est temporairement indisponible

# errorsOauthInitializationFailed
source: Failed to initialize OAuth flow
de: Initialisierung des OAuth-Flows fehlgeschlagen
es: Error al inicializar flujo de OAuth
fr: Échec de l'initialisation du flux OAuth

# errorsTokenStorageFailed
source: Failed to store authentication tokens
de: Speichern der Authentifizierungstoken fehlgeschlagen
es: Error al almacenar tokens de autenticación
fr: Échec du stockage des jetons d'authentification

# errorsOauthStateMismatch
source: Security validation failed. Please try again
de: Sicherheitsvalidierung fehlgeschlagen. Bitte erneut versuchen
es: Validación de seguridad fallida. Por favor intenta de nuevo
fr: Échec de la validation de sécurité. Veuillez réessayer

# errorsTokenExchangeFailed
source: Failed to exchange authorization code
de: Austausch des Autorisierungscodes fehlgeschlagen
es: Error al intercambiar código de autorización
fr: Échuc de l'échange du code d'autorisation

# errorsOauthAuthorizationDenied
source: Authorization was denied
de: Autorisierung verweigert
es: Autorización denegada
fr: Autorisation refusée

# errorsWebViewLoadFailed
source: Failed to load authentication page
de: Laden der Authentifizierungsseite fehlgeschlagen
es: Error al cargar página de autenticación
fr: Échec du chargement de la page d'authentification

# errorsFailedToLoadProfile
source: Failed to load user profile
de: Laden des Benutzerprofils fehlgeschlagen
es: Error al cargar perfil de usuario
fr: Échec du chargement du profil utilisateur

# errorsUserNotFound
source: User not found
de: Benutzer nicht gefunden
es: Usuario no encontrado
fr: Utilisateur non trouvé

# errorsSessionDeleted
source: Session has been deleted
de: Sitzung wurde gelöscht
es: La sesión ha sido eliminada
fr: La session a été supprimée

# errorsSessionDeletedDescription
source: This session has been permanently removed
de: Diese Sitzung wurde dauerhaft entfernt
es: Esta sesión ha sido eliminada permanentemente
fr: Cette session a été définitivement supprimée

# errorsValidationError
source: {field} must be between {min} and {max}
de: {field} muss zwischen {min} und {max} liegen
es: {field} debe estar entre {min} y {max}
fr: {field} doit être entre {min} et {max}

# errorsRetryIn
source: Retry in {seconds, plural, =1 {1 second} other {{seconds} seconds}}
de: Wiederholen in {seconds, plural, =1 {1 Sekunde} other {{seconds} Sekunden}}
es: Reintentar en {seconds, plural, =1 {1 segundo} other {{seconds} segundos}}
fr: Réessayer dans {seconds, plural, =1 {1 seconde} other {{seconds} secondes}}

# errorsDisconnectServiceFailed
source: Failed to disconnect {service}
de: Trennen von {service} fehlgeschlagen
es: Error al desconectar {service}
fr: Échec de la déconnexion de {service}

# errorsConnectServiceFailed
source: Failed to connect {service}. Please try again.
de: Verbinden von {service} fehlgeschlagen. Bitte erneut versuchen.
es: Error al conectar {service}. Por favor intenta de nuevo.
fr: Échec de la connexion à {service}. Veuillez réessayer.

# errorsFailedToLoadFriends
source: Failed to load friends list
de: Laden der Freundesliste fehlgeschlagen
es: Error al cargar lista de amigos
fr: Échec du chargement de la liste d'amis

# errorsFailedToAcceptRequest
source: Failed to accept friend request
de: Annehmen der Freundschaftsanfrage fehlgeschlagen
es: Error al aceptar solicitud de amistad
fr: Échec de l'acceptation de la demande d'ami

# errorsFailedToRejectRequest
source: Failed to reject friend request
de: Ablehnen der Freundschaftsanfrage fehlgeschlagen
es: Error al rechazar solicitud de amistad
fr: Échec du rejet de la demande d'ami

# errorsFailedToRemoveFriend
source: Failed to remove friend
de: Entfernen des Freundes fehlgeschlagen
es: Error al eliminar amigo
fr: Échec de la suppression de l'ami

# errorsSearchFailed
source: Search failed. Please try again.
de: Suche fehlgeschlagen. Bitte erneut versuchen.
es: Búsqueda fallida. Por favor intenta de nuevo.
fr: Échec de la recherche. Veuillez réessayer.

# errorsFailedToSendRequest
source: Failed to send friend request
de: Senden der Freundschaftsanfrage fehlgeschlagen
es: Error al enviar solicitud de amistad
fr: Échuc de l'envoi de la demande d'ami

# terminalWebBrowserRequired
source: Web Browser Required
de: Webbrowser erforderlich
es: Navegador web requerido
fr: Navigateur Web requis

# terminalWebBrowserRequiredDescription
source: Terminal connection links can only be opened in a web browser for security reasons. Please use the QR code scanner or open this link on a computer.
de: Terminal-Verbindungslinks können aus Sicherheitsgründen nur in einem Webbrowser geöffnet werden. Bitte verwenden Sie den QR-Code-Scanner oder öffnen Sie diesen Link auf einem Computer.
es: Los enlaces de conexión de terminal solo pueden abrirse en un navegador web por razones de seguridad. Por favor usa el escáner de código QR o abre este enlace en una computadora.
fr: Les liens de connexion au terminal ne peuvent être ouverts que dans un navigateur Web pour des raisons de sécurité. Veuillez utiliser le scanner de code QR ou ouvrir ce lien sur un ordinateur.

# terminalProcessingConnection
source: Processing connection...
de: Verbindung wird verarbeitet...
es: Procesando conexión...
fr: Traitement de la connexion...

# terminalInvalidConnectionLink
source: Invalid Connection Link
de: Ungültiger Verbindungslink
es: Enlace de conexión inválido
fr: Lien de connexion invalide

# terminalInvalidConnectionLinkDescription
source: The connection link is missing or invalid. Please check the URL and try again.
de: Der Verbindungslink fehlt oder ist ungültig. Bitte überprüfen Sie die URL und versuchen Sie es erneut.
es: El enlace de conexión falta o es inválido. Por favor verifica la URL e intenta de nuevo.
fr: Le lien de connexion est manquant ou invalide. Veuillez vérifier l'URL et réessayer.

# terminalConnectTerminal
source: Connect Terminal
de: Terminal verbinden
es: Conectar terminal
fr: Connecter le terminal

# terminalRequestDescription
source: A terminal is requesting to connect to your Happy Coder account. This will allow the terminal to send and receive messages securely.
de: Ein Terminal möchte sich mit Ihrem Happy Coder-Konto verbinden. Dies ermöglicht dem Terminal, Nachrichten sicher zu senden und zu empfangen.
es: Una terminal está solicitando conectarse a tu cuenta de Happy Coder. Esto permitirá que la terminal envíe y reciba mensajes de forma segura.
fr: Un terminal demande à se connecter à votre compte Happy Coder. Cela permettra au terminal d'envoyer et de recevoir des messages en toute sécurité.

# terminalConnectionDetails
source: Connection Details
de: Verbindungsdetails
es: Detalles de conexión
fr: Détails de la connexion

# terminalPublicKey
source: Public Key
de: Öffentlicher Schlüssel
es: Clave pública
fr: Clé publique

# terminalEncryption
source: Encryption
de: Verschlüsselung
es: Cifrado
fr: Cryptage

# terminalEndToEndEncrypted
source: End-to-end encrypted
de: Ende-zu-Ende-verschlüsselt
es: Cifrado de extremo a extremo
fr: Cryptage de bout en bout

# terminalAcceptConnection
source: Accept Connection
de: Verbindung akzeptieren
es: Aceptar conexión
fr: Accepter la connexion

# terminalConnecting
source: Connecting...
de: Verbinden...
es: Conectando...
fr: Connexion...

# terminalReject
source: Reject
de: Ablehnen
es: Rechazar
fr: Rejeter

# terminalSecurity
source: Security
de: Sicherheit
es: Seguridad
fr: Sécurité

# terminalSecurityFooter
source: This connection link was processed securely in your browser and was never sent to any server. Your private data will remain secure and only you can decrypt the messages.
de: Dieser Verbindungslink wurde sicher in Ihrem Browser verarbeitet und wurde nie an einen Server gesendet. Ihre privaten Daten bleiben sicher und nur Sie können die Nachrichten entschlüsseln.
es: Este enlace de conexión fue procesado de forma segura en tu navegador y nunca fue enviado a ningún servidor. Tus datos privados permanecerán seguros y solo tú puedes descifrar los mensajes.
fr: Ce lien de connexion a été traité en toute sécurité dans votre navigateur et n'a jamais été envoyé à un serveur. Vos données privées resteront sécurisées et seul vous pouvez déchiffrer les messages.

# terminalSecurityFooterDevice
source: This connection was processed securely on your device and was never sent to any server. Your private data will remain secure and only you can decrypt the messages.
de: Diese Verbindung wurde sicher auf Ihrem Gerät verarbeitet und wurde nie an einen Server gesendet. Ihre privaten Daten bleiben sicher und nur Sie können die Nachrichten entschlüsseln.
es: Esta conexión fue procesada de forma segura en tu dispositivo y nunca fue enviada a ningún servidor. Tus datos privados permanecerán seguros y solo tú puedes descifrar los mensajes.
fr: Cette connexion a été traitée en toute sécurité sur votre appareil et n'a jamais été envoyée à un serveur. Vos données privées resteront sécurisées et seul vous pouvez déchiffrer les messages.

# terminalClientSideProcessing
source: Client-Side Processing
de: Clientseitige Verarbeitung
es: Procesamiento del lado del cliente
fr: Traitement côté client

# terminalLinkProcessedLocally
source: Link processed locally in browser
de: Link lokal im Browser verarbeitet
es: Enlace procesado localmente en el navegador
fr: Lien traité localement dans le navigateur

# terminalLinkProcessedOnDevice
source: Link processed locally on device
de: Link lokal auf dem Gerät verarbeitet
es: Enlace procesado localmente en el dispositivo
fr: Lien traité localement sur l'appareil

# sidebarSessionsTitle
source: Terminals
es: Terminales
fr: Terminaux

# sidebarStatusConnected
source: Connected
de: Verbunden
es: Conectado
fr: Connecté

# sidebarStatusConnecting
source: Connecting...
de: Verbinden...
es: Conectando...
fr: Connexion...

# sidebarStatusDisconnected
source: Disconnected
de: Getrennt
es: Desconectado
fr: Déconnecté

# commandPalettePlaceholder
source: Type a command or search...
de: Befehl eingeben oder suchen...
es: Escribe un comando o busca...
fr: Tapez une commande ou recherchez...

# toolViewInput
source: Input
de: Eingabe
es: Entrada
fr: Entrée

# toolViewOutput
source: Output
de: Ausgabe
es: Salida
fr: Sortie

# toolViewDescription
source: Description
de: Beschreibung
es: Descripción

# toolViewInputParams
source: Input Parameters
de: Eingabeparameter
es: Parámetros de entrada
fr: Paramètres d'entrée

# toolViewCompleted
source: Tool completed successfully
de: Tool erfolgreich abgeschlossen
es: Herramienta completada exitosamente
fr: Outil terminé avec succès

# toolViewNoOutput
source: No output was produced
de: Keine Ausgabe produziert
es: No se produjo ninguna salida
fr: Aucune sortie produite

# toolViewRunning
source: Tool is running...
de: Tool wird ausgeführt...
es: La herramienta está ejecutándose...
fr: L'outil est en cours d'exécution...

# toolViewRawJsonDevMode
source: Raw JSON (Dev Mode)
de: Rohe JSON (Dev-Modus)
es: JSON sin procesar (modo desarrollo)
fr: JSON brut (mode dev)

# toolNamesTask
source: Task
de: Aufgabe
es: Tarea
fr: Tâche

# toolNamesSearchFiles
source: Search Files
de: Dateien suchen
es: Buscar archivos
fr: Rechercher des fichiers

# toolNamesSearch
source: Search
de: Suchen
es: Buscar
fr: Rechercher

# toolNamesSearchContent
source: Search Content
de: Inhalt suchen
es: Buscar contenido
fr: Rechercher du contenu

# toolNamesListFiles
source: List Files
de: Dateien auflisten
es: Listar archivos
fr: Lister les fichiers

# toolNamesPlanProposal
source: Plan proposal
de: Vorschlag
es: Propuesta de plan
fr: Proposition de plan

# toolNamesReadFile
source: Read File
de: Datei lesen
es: Leer archivo
fr: Lire le fichier

# toolNamesEditFile
source: Edit File
de: Datei bearbeiten
es: Editar archivo
fr: Modifier le fichier

# toolNamesWriteFile
source: Write File
de: Datei schreiben
es: Escribir archivo
fr: Écrire le fichier

# toolNamesFetchUrl
source: Fetch URL
de: URL abrufen
es: Obtener URL
fr: Récupérer l'URL

# toolNamesReadNotebook
source: Read Notebook
de: Notizbuch lesen
es: Leer cuaderno
fr: Lire le carnet

# toolNamesEditNotebook
source: Edit Notebook
de: Notizbuch bearbeiten
es: Editar cuaderno
fr: Modifier le carnet

# toolNamesTodoList
source: Todo List
de: Todo-Liste
es: Lista de tareas
fr: Liste de tâches

# toolNamesWebSearch
source: Web Search
de: Websuche
es: Buscar en web
fr: Recherche Web

# toolNamesReasoning
source: Reasoning
de: Argumentation
es: Razonamiento
fr: Raisonnement

# toolNamesApplyChanges
source: Update file
de: Datei aktualisieren
es: Actualizar archivo
fr: Mettre à jour le fichier

# toolNamesViewDiff
source: Current file changes
de: Aktuelle Dateiänderungen
es: Cambios actuales del archivo
fr: Modifications du fichier actuel

# toolNamesQuestion
source: Question
de: Frage
es: Pregunta

# toolDescSearchPattern
source: Search(pattern: {pattern})
de: Suchen(Muster: {pattern})
es: Buscar(patrón: {pattern})
fr: Rechercher(motif: {pattern})

# toolDescSearchPath
source: Search(path: {basename})
de: Suchen(Pfad: {basename})
es: Buscar(ruta: {basename})
fr: Rechercher(chemin: {basename})

# toolDescFetchUrlHost
source: Fetch URL(url: {host})
de: URL abrufen(url: {host})
es: Obtener URL(url: {host})
fr: Récupérer l'URL(url: {host})

# toolDescEditNotebookMode
source: Edit Notebook(file: {path}, mode: {mode})
de: Notizbuch bearbeiten(Datei: {path}, Modus: {mode})
es: Editar cuaderno(archivo: {path}, modo: {mode})
fr: Modifier le carnet(fichier: {path}, mode: {mode})

# toolDescTodoListCount
source: Todo List(count: {count})
de: Todo-Liste(Anzahl: {count})
es: Lista de tareas(cuenta: {count})
fr: Liste de tâches(compte: {count})

# toolDescWebSearchQuery
source: Web Search(query: {query})
de: Websuche(Abfrage: {query})
es: Buscar en web(consulta: {query})
fr: Recherche Web(requête: {query})
