Repository: denysvitali/happy_flutter
Catalog: l10n/app_*.arb
Languages: de, es, fr

# friendsStatusNone
source: Not connected
de: Nicht verbunden
es: No conectado
fr: Non connecté

# friendsStatusRequested
source: Request sent
de: Anfrage gesendet
es: Solicitud enviada
fr: Demande envoyée

# friendsStatusPending
source: Request pending
de: Anfrage ausstehend
es: Solicitud pendiente
fr: Demande en attente

# friendsStatusFriend
source: Friends
de: Freunde
es: Amigos
fr: Amis

# friendsStatusRejected
source: Rejected
de: Abgelehnt
es: Rechazado
fr: Rejeté

# friendsAcceptRequest
source: Accept Request
de: Anfrage akzeptieren
es: Aceptar solicitud
fr: Accepter la demande

# friendsRemoveFriend
source: Remove Friend
de: Freund entfernen
es: Eliminar amigo
fr: Supprimer l'ami

# friendsRemoveFriendConfirm
source: Are you sure you want to remove {name} as a friend?
de: Sind Sie sicher, dass Sie {name} als Freund entfernen möchten?
es: ¿Estás seguro de que deseas eliminar a {name} como amigo?
fr: Êtes-vous sûr de vouloir supprimer {name} de vos amis ?

# friendsRequestSentDescription
source: Your friend request has been sent to {name}
de: Ihre Freundschaftsanfrage wurde an {name} gesendet
es: Tu solicitud de amistad ha sido enviada a {name}
fr: Votre demande d'ami a été envoyée à {name}

# friendsRequestFriendship
source: Request friendship
de: Freundschaft anfragen
es: Solicitar amistad
fr: Demander l'amitié

# friendsCancelRequest
source: Cancel friendship request
de: Freundschaftsanfrage canceln
es: Cancelar solicitud de amistad
fr: Annuler la demande d'amitié

# friendsCancelRequestConfirm
source: Cancel your friendship request to {name}?
de: Ihre Freundschaftsanfrage an {name} canceln?
es: ¿Cancelar tu solicitud de amistad a {name}?
fr: Annuler votre demande d'amitié à {name} ?

# friendsDenyRequest
source: Deny friendship
de: Freundschaft ablehnen
es: Denegar amistad
fr: Refuser l'amitié

# friendsNowFriendsWith
source: You are now friends with {name}
de: Sie sind jetzt befreundet mit {name}
es: Ahora eres amigo de {name}
fr: Vous êtes maintenant ami avec {name}

# feedFriendRequestFrom
source: {name} sent you a friend request
de: {name} hat Ihnen eine Freundschaftsanfrage gesendet
es: {name} te envió una solicitud de amistad
fr: {name} vous a envoyé une demande d'ami

# feedFriendRequestGeneric
source: New friend request
de: Neue Freundschaftsanfrage
es: Nueva solicitud de amistad
fr: Nouvelle demande d'ami

# feedFriendAccepted
source: You are now friends with {name}
de: Sie sind jetzt befreundet mit {name}
es: Ahora eres amigo de {name}
fr: Vous êtes maintenant ami avec {name}

# feedFriendAcceptedGeneric
source: Friend request accepted
de: Freundschaftsanfrage akzeptiert
es: Solicitud de amistad aceptada
fr: Demande d'ami acceptée

# usageToday
source: Today
de: Heute
es: Hoy
fr: Aujourd'hui

# usageLast7Days
source: Last 7 days
de: Letzte 7 Tage
es: Últimos 7 días
fr: 7 derniers jours

# usageLast30Days
source: Last 30 days
de: Letzte 30 Tage
es: Últimos 30 días
fr: 30 derniers jours

# usageTotalTokens
source: Total Tokens
de: Gesamte Tokens
es: Tokens totales
fr: Jetons totaux

# usageTotalCost
source: Total Cost
de: Gesamtkosten
es: Costo total
fr: Coût total

# usageCost
source: Cost
de: Kosten
es: Costo
fr: Coût

# usageUsageOverTime
source: Usage over time
de: Nutzung über die Zeit
es: Uso a lo largo del tiempo
fr: Utilisation au fil du temps

# usageByModel
source: By Model
de: Nach Modell
es: Por modelo
fr: Par modèle

# usageNoData
source: No usage data available
de: Keine Nutzungsdaten verfügbar
es: No hay datos de uso disponibles
fr: Aucune donnée d'utilisation disponible

# commonNo
source: No
de: Nein
fr: Non

# commonError
source: Error
de: Fehler
fr: Erreur

# statusError
source: Error
de: Fehler
fr: Erreur

# sessionInfoHost
source: Host
fr: Hôte

# settingsEula
source: EULA
fr: CLUF

# settingsUsageTokens
source: Tokens
fr: Jetons

# errorsErrorWithCode
source: {message} (Error {code})
de: {message} (Fehler {code})
fr: {message} (Erreur {code})

# sidebarStatusError
source: Error
de: Fehler
fr: Erreur

# toolViewError
source: Error
de: Fehler
fr: Erreur

# usageTokens
source: Tokens
fr: Jetons

# sessionTypeSimple
source: Simple
de: Einfach

# settingsSocial
source: Social
de: Soziales
